# مش شغلي انا سارق الملف
import asyncio
import requests
import random
import re
import textwrap
import aiofiles
import aiohttp
import os
import sqlite3
import time
import datetime
from pyrogram import Client as client
import json
import redis, re
from PIL import Image, ImageDraw, ImageEnhance, ImageFilter, ImageFont, ImageOps
from pyrogram.types import (Message,InlineKeyboardButton,InlineKeyboardMarkup,CallbackQuery,ChatPrivileges)
from pyrogram import filters, Client
from pyrogram.enums import ChatMembersFilter
from pyrogram.enums import ChatMemberStatus
from typing import List, Union
from pyrogram import *
from dotenv import load_dotenv
from os import getenv
from pyrogram.types import InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup
from pyrogram.types import *
from pyrogram.errors import PeerIdInvalid
import aiohttp
from datetime import datetime
from random import choice
from collections import defaultdict
from pyrogram import enums
from pyrogram.types import ChatPermissions, ChatPrivileges
from aiohttp import ClientSession
from traceback import format_exc
import string
#import lyricsgenius as lg
from pyrogram.types import (InlineKeyboardButton, ChatPermissions, InlineKeyboardMarkup, Message, User)
import sys
from pyrogram.errors import FloodWait
from os import remove
from asyncio import sleep
from pyrogram.types import *
from telegraph import upload_file
from unidecode import unidecode
import sqlite3
from pyrogram import Client, idle
from random import randint
from pytgcalls.exceptions import (NoActiveGroupCall,TelegramServerError,AlreadyJoinedError)
from pyrogram.enums import ChatType
from pyrogram.types import Chat, User
from pyrogram.types import (InlineKeyboardButton,CallbackQuery,InlineKeyboardMarkup, Message)
from asyncio import gather
from io import BytesIO
from pyrogram import Client, filters
from config import *
import logging
import re
from AnonXMusic import app as Client
#كتابته العبد الفقير قيصر 😎

logging.basicConfig(level=logging.INFO)
        

@Client.on_message(filters.command(["قتل","تخ"], ""), group=1024)
async def ceev(client, message):
    
        caesar = await client.get_chat(message.from_user.id)
        CASER = caesar.username
        usr = await client.get_users(message.reply_to_message.from_user.id)
        name = usr.username
        user_id = message.reply_to_message.from_user.id
        chat_id = message.chat.id
        await message.reply_video(
          video="https://telegra.ph/file/a2c9fa6de45e0fc4fc81e.mp4",
          caption=f"• تم قتل هذا الشخص @{name}\n\n※ بواسطة @{CASER}\n\n ان لله وان اليه راجعون ⚰😭",
          reply_markup=InlineKeyboardMarkup([[InlineKeyboardButton("المقتول ⚰??", url=f"https://t.me/{name}"), 
                                ],[InlineKeyboardButton("القاتل 👿🔪", url=f"https://t.me/{CASER}"), 
                                ],[InlineKeyboardButton("ضيفني في جروب والنبي🥺♥", url=f"https://t.me/{bot_username}?startgroup=tru")]]))
                                
@Client.on_message(filters.command(["بوسه","مح"], ""), group=1025554)
async def cee6v(client, message):
    
        caesar = await client.get_chat(message.from_user.id)
        CASER = caesar.username
        usr = await client.get_users(message.reply_to_message.from_user.id)
        name = usr.username
        user_id = message.reply_to_message.from_user.id
        chat_id = message.chat.id
        await message.reply_video(
          video="https://telegra.ph/file/f9fca108067895e042f1f.mp4",
          caption=f"••القميل هذا ✨♥ @{CASER}\n\n※ بعتلك بوسه يا 😘♥ @{name} \n\n عيب كده اي المحن ده 😹",
          reply_markup=InlineKeyboardMarkup([[InlineKeyboardButton("المقبول 👻??", url=f"https://t.me/{name}"), 
                                ],[InlineKeyboardButton("القابل 😘🥹", url=f"https://t.me/{CASER}"), 
                                ],[InlineKeyboardButton("ضيفني في جروب والنبي🥺♥", url=f"https://t.me/{bot_username}?startgroup=tru")]]))         


@Client.on_message(filters.command(["تفو","تف"], ""), group=105524)
async def ceev55(client, message):
    
        caesar = await client.get_chat(message.from_user.id)
        CASER = caesar.username
        usr = await client.get_users(message.reply_to_message.from_user.id)
        name = usr.username
        user_id = message.reply_to_message.from_user.id
        chat_id = message.chat.id
        await message.reply_video(
          video="https://telegra.ph/file/7f4c6eebf2f23b41dea45.mp4",
          caption=f"• تم التف علي هذا الشخص @{name}\n\n※ بواسطة @{CASER} \n\n اععع اي القرف ده 🤢",
          reply_markup=InlineKeyboardMarkup([[InlineKeyboardButton("المتفوف عليه😂💔", url=f"https://t.me/{name}"), 
                                ],[InlineKeyboardButton("التافف 😂👻", url=f"https://t.me/{CASER}"), 
                                ],[InlineKeyboardButton("ضيفني في جروب والنبي🥺♥", url=f"https://t.me/{bot_username}?startgroup=tru")]]))              


@Client.on_message(filters.command(["غنيلي", "غني", "❤️‍🔥غنيلي", "غنيي"], ""), group=73)
async def ih25d(client, message):
    
    rl = random.randint(2, 90)
    url = f"https://t.me/gukygn/{rl}"
    await client.send_voice(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["صوره", "❤️‍🔥صوره", "صورهه", "صور"], ""), group=713)
async def ihd21(client, message):
    
    rl = random.randint(2, 100)
    url = f"https://t.me/Caser_Rady_3/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥انمي", "انمي"], ""), group=723)
async def i15hd(client, message):
    
    rl = random.randint(2, 90)
    url = f"https://t.me/LoreBots7/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥متحركه", "متحركه"], ""), group=733)
async def ih48d(client, message):
    
    rl = random.randint(2, 90)
    url = f"https://t.me/GifWaTaN/{rl}"
    await client.send_animation(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥اقتباسات", "اقتباس"], ""), group=753)
async def ih289d(client, message):
    
    rl = random.randint(2, 90)
    url = f"https://t.me/LoreBots9/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["هيدرا", "❤️‍🔥هيدرات"], ""), group=743)
async def ih67d(client, message):
    
    rl = random.randint(2, 90)
    url = f"https://t.me/flflfldld/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥صور بنات", "صور بنات"], ""), group=763)
async def ih467d(client, message):
    
    rl = random.randint(2, 70)
    url = f"https://t.me/Caser_Rady_1/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["صور شباب", "❤️‍🔥صور شباب"], ""), group=773)
async def i378hd(client, message):
    
    rl = random.randint(2, 70)
    url = f"https://t.me/Caser_Rady_2/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥قران", "قران"], ""), group=783)
async def ihd97(client, message):
    
    rl = random.randint(1, 90)
    url = f"https://t.me/opuml/{rl}"
    await client.send_voice(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥الشيخ نقشبندي", "النقشبندي", "نقشبندي"], ""), group=793) 
async def ih907d(client, message):
    
    rl = random.randint(1, 90)
    url = f"https://t.me/ggcnjj/{rl}"
    await client.send_voice(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["فيلم", "❤️‍🔥فيلم"], ""), group=7823) 
async def ih579d(client, message):
    
    rl = random.randint(2, 34)
    url = f"https://t.me/gyigkk/{rl}"
    await client.send_audio(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["استوري", "❤️‍🔥استوريهات"], ""), group=7553) 
async def i803hd(client, message):
    
    rl = random.randint(1, 50)
    url = f"https://t.me/yoipopl/{rl}"
    await client.send_audio(message.chat.id, url, caption=f"@{client.me.username}", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["كت","تويت","❤️‍🔥كت","تويت"], ""), group=764653) 
async def cu24tt(client, message):
        
    rl = random.randint(2, 400)
    url = f"https://t.me/Caser_Rady/{rl}"
    name = url.replace("https://t.me/", "")
    path_parts = name.split("/")
    group_id = path_parts[0]
    message_id = int(path_parts[1])    
    await client.copy_message(message.chat.id, group_id, message_id, reply_to_message_id=message.id)

@Client.on_message(filters.command(["مثل" ,"امثله"], ""), group=70973)
async def cae57sar(client, message):
    
    rl = random.randint(2, 168)
    url = f"https://t.me/Caser_Rady_5/{rl}"
    name = url.replace("https://t.me/", "")
    path_parts = name.split("/")
    group_id = path_parts[0]
    message_id = int(path_parts[1])    
    await client.copy_message(message.chat.id, group_id, message_id, reply_to_message_id=message.id)

@Client.on_message(filters.command(["خيروك","خيرني","❤️‍🔥خيرني", "لو خيروك"], ""), group=764643)
async def khyro(client, message):
    
    rl = random.randint(2, 230)
    url = f"https://t.me/Caser_Rady_4/{rl}"
    name = url.replace("https://t.me/", "")
    path_parts = name.split("/")
    group_id = path_parts[0]
    message_id = int(path_parts[1])    
    await client.copy_message(message.chat.id, group_id, message_id, reply_to_message_id=message.id)
    
txt = [

"عامل الناس بأخلاقك ولا بأخلاقهم", 
"الجمال يلفت الأنظار لكن الطيبه تلفت القلوب ", 
"الاعتذار عن الأخطاء لا يجرح كرامتك بل يجعلك كبير في نظر الناس ",
"لا ترجي السماحه من بخيل.. فما في البار لظمان ماء",
"لا تحقرون صغيره إن الجبال من الحصي",
"لا تستحي من إعطاء فإن الحرمان أقل منه ", 
"لا تظلم حتى لا تتظلم ",
"لا تقف قصاد الريح ولا تمشي معها ",
"لا تكسب موده التحكم الا بالتعقل",
"لا تمد عينك في يد غيرك ",
"لا تملح الا لمن يستحقاها ويحافظ عليها",
"لا حياه للإنسان بلا نبات",
"لا حياه في الرزق.. ولا شفاعه في الموت",
"كما تدين تدان",
"لا دين لمن لا عهد له ",
"لا سلطان على الدوق فيما يحب أو بكره",
"لا مروه لمن لادين له ",
"لا يدخل الجنه من لايأمن من جازه بوائقه",
"يسروا ولا تعسروا... ويشورا ولا تنفروا",
"يدهم الصدر ما يبني العقل الواسع ",
"أثقل ما يوضع في الميزان يوم القيامة حسن الخلق ",
"أجهل الناس من ترك يقين ما عنده لظن ما عند الناس ",
"أحياناً.. ويصبح الوهم حقيقه ",
"مينفعش تعاتب حد مبيعملش حساب لزعلك عشان متزعلش مرتين . ",
"السفر ومشاهده اماكن مختلفه وجديده ",
"عدم تضيع الفرص واسثمارها لحظه مجبئها ",
" اعطاء الاخرين اكثر من ما يتوقعون",
"معامله الناس بلطف ولكن عدم السماح لاحد بستغالال ذالك ",
"تكوين صدقات جديده مع الحفظ بلاصدقاء القودامي ",
"تعلم اصول المهنه بدلا من تضيع الوقت ف تعلم حيل المهنه ",
"مدح ع الاقل ثلاث اشخاص يوميا ",
"النظر ف عيون الشخاص عند مخاطبتهم ",
"التحلي بلسماح مع الاخرين او النفس ",
"الاكثار من قول كلمه شكرا ",
" مصافحه الاخرين بثبات وقوة ",
"الابتعاد عن المناطق السيئه السمعه لتجنب الاحداث السئه ",
" ادخار 10٪ع الاقل من الدخل",
" تجنب المخاوف من خلال التعلم من تجارب مختلفه",
" الحفاظ ع السمعه لانها اغلي ما يملك الانسان",
" تحويل الاعداء الي اصدقاء من خلال القيام بعمل جيد",
"لا تصدق كل ما تسمعع. ولا تنفق كل ما تمتلك . ولا تنم قدر ما ترغب ",
" اعتني بسمعتك جيدا فستثبت للك الايام انها اغلي ما تملك",
"حين تقول والدتك ستندم ع فعل ذالك ستندم عليه غالبا.. ",
" لا تخش العقبات الكبيره فخلفها تقع الفرص العظيمه",
"قد لا يتطلب الامر اكثر من شخص واحد لقلب حياتك رأس ع عقب ",
"اختر رفيقه حياتك بحرص فهو قرار سيشكل 90٪من سعادتك او بؤسك ",
" اقلب اداءك الاصدقاء بفعل شي جميل ومفجائ لهم",
"حين تدق الفرصه ع باباك ادعوها للبيت ",
"تعلم القواعد جيدا ثن اكسر بعدها ",
"احكم ع نجاحك من خلال قدرتك ع العطاء وليس الاخذ ",
" لا تتجاهل الشيطان مهما بدل ثيابه",
"ركز ع جعل الاشياء افضل وليس اكبر او اعظم ",
"كن سعيد  بما تمتلك واعمل لامتلاك ما تريد ",
"اعط الناس اكثر من ما يتوقعون ",
" لا تكن منشغل لدرجه عدم التعرف ع اصدقاء جدد",
"استحمه يوم العيد يمعفن🐰",
"مش تحب اي حد يقرب منك ",
" خليك مع البت راجل خليك تقيل",
" انصح نفسك بنفسك بمت😂",
" كنت نصحت نفسي ياخويا🗿", 

        ]
      
@Client.on_message(filters.command(["انصحني","❤️‍🔥انصحني"], ""), group=6761)
async def anshny(client, message):
    
    a = random.choice(txt)
    await message.reply(f"{a}")
        
tt = [
" مدينة بحرف ⇦ ع  ",
" حيوان ونبات بحرف ⇦ خ  ", 
" اسم بحرف ⇦ ح  ", 
" اسم ونبات بحرف ⇦ م  ", 
" دولة عربية بحرف ⇦ ق  ", 
" جماد بحرف ⇦ ي  ", 
" نبات بحرف ⇦ ج  ", 
" اسم بنت بحرف ⇦ ع  ", 
" اسم ولد بحرف ⇦ ع  ", 
" اسم بنت وولد بحرف ⇦ ث  ", 
" جماد بحرف ⇦ ج  ",
" حيوان بحرف ⇦ ص  ",
" دولة بحرف ⇦ س  ",
" نبات بحرف ⇦ ج  ",
" مدينة بحرف ⇦ ب  ",
" نبات بحرف ⇦ ر  ",
" اسم بحرف ⇦ ك  ",
" حيوان بحرف ⇦ ظ  ",
" جماد بحرف ⇦ ذ  ",
" مدينة بحرف ⇦ و  ",
" اسم بحرف ⇦ م  ",
" اسم بنت بحرف ⇦ خ  ",
" اسم و نبات بحرف ⇦ ر  ",
" نبات بحرف ⇦ و  ",
" حيوان بحرف ⇦ س  ",
" مدينة بحرف ⇦ ك  ",
" اسم بنت بحرف ⇦ ص  ",
" اسم ولد بحرف ⇦ ق  ",
" نبات بحرف ⇦ ز  ",
"  جماد بحرف ⇦ ز  ",
"  مدينة بحرف ⇦ ط  ",
"  جماد بحرف ⇦ ن  ",
"  مدينة بحرف ⇦ ف  ",
"  حيوان بحرف ⇦ ض  ",
"  اسم بحرف ⇦ ك  ",
"  نبات و حيوان و مدينة بحرف ⇦ س  ", 
"  اسم بنت بحرف ⇦ ج  ", 
"  مدينة بحرف ⇦ ت  ", 
"  جماد بحرف ⇦ ه  ", 
"  اسم بنت بحرف ⇦ ر  ", 
" اسم ولد بحرف ⇦ خ  ", 
" جماد بحرف ⇦ ع  ",
" حيوان بحرف ⇦ ح  ",
" نبات بحرف ⇦ ف  ",
" اسم بنت بحرف ⇦ غ  ",
" اسم ولد بحرف ⇦ و  ",
" نبات بحرف ⇦ ل  ",
"مدينة بحرف ⇦ ع  ",
"دولة واسم بحرف ⇦ ب  ",
        ]
@Client.on_message(filters.command(["حروف","❤️‍🔥حروف"], ""), group=157) 
async def ahrof(client, message):
    
    a = random.choice(tt)
    await message.reply(f"{a}")

xt = ["لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ🌸",
                     "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ , وَشُكْرِكَ , وَحُسْنِ عِبَادَتِكَ🎈💞",
                     "استغفر الله العظيم وأتوبُ إليه 🌹",
                     "حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم"
                     "ِ سبع مرات، كفاه الله تعالى ما أهمه من أمور الدنيا والآخرة🌹🌸",
                     "ربنا اغفر لنا ذنوبنا وإسرافنا فِي أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين🌸",
                     "أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
                     "سبحان الله وبحمده سبحان الله العظيم🌸",
                     "أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
                     "اللهم إنك عفو تُحب العفو فاعفُ عنّا 🌿🌹",
                     "استغفر الله العظيم وأتوبُ إليه 🌹",
                     "لا تقطع صلاتك، إن كنت قادراً على الصلاة في الوقت فصلِي و أكثر من الدعاء لتحقيق ما تتمنى💙",
                     "قال ﷺ : ”حَيْثُمَا كُنْتُمْ فَصَلُّوا عَلَيَّ، فَإِنَّ صَلَاتَكُمْ تَبْلُغُنِي“.",
                     "يا رب أفرحني بشيئاً انتظر حدوثه،اللهم إني متفائلاً بعطائك فاكتب لي ما أتمنى🌸",
                     "﴿ رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي ﴾",
                     "‏{ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ }",
                     "‏اللهّم لطفك بقلوبنا وأحوالنا وأيامنا ،‏اللهّم تولنا بسعتك وعظيم فضلك ",
                     "ومن أحسن قولاً ممن دعا إلى الله وعمل صالحاً وقال أنني من المسلمين .💕",
                     "‏إن الله لا يبتليك بشيء إلا وبه خيرٌ لك فقل الحمدلله.",
                     "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ",
                     "اللهم اشفي كل مريض يتألم ولا يعلم بحاله إلا أنت",
                     "استغفر الله العظيم وأتوبُ إليه.",
                     "‏لَم تعرف الدنيا عظيماً مِثله صلّوا عليه وسلموا تسليم",
                     " أنتَ اللّطيف وأنا عبدُك الضّعيف اغفرلي وارحمني وتجاوز عنّي.",
                     "ماتستغفر ربنا كده🥺❤️",
                     "فاضي شويه نصلي ع النبي ونحز خته فى الجنه❤️❤️",
                     "ماتوحدو ربنا يجماعه قولو لا اله الا الله❤️❤️",
                     "يلا كل واحد يقول سبحان الله وبحمده سبحان الله العظيم 3 مرات🙄❤️",
                     "قول لاحول ولا قوه الا بالله يمكن تفك كربتك🥺❤️",
                     "اللهم صلي عللى سيدنا محمد ماتصلي على النبي كده",
                     "- أسهل الطرق لإرضاء ربك، أرضي والديك 🥺💕",
                     "- اللهُم صبراً ، اللهم جبراً ، اللهم قوّة",
                     "أصبحنا وأصبح الملك لله ولا اله الا الله.",
                     "‏إنَّ اللهَ يُحِبُ المُلحِينَ فِي الدُّعَاء.",
                     "‏إن الله لا يخذل يداً رُفعت إليه أبداً.",
                     "يارب دُعاء القلب انت تسمعه فأستجب لهُ.",
                     "- اللهم القبول الذي لا يزول ❤️🍀.",
                     "- اللهُم خذ بقلبّي حيث نورك الذي لا ينطفِئ.",
                     "سبحان الله وبحمده ،سبحان الله العظيم.",
                     "لا تعودوا أنفسكم على الصمت، اذكرو الله، استغفروه، سبّحوه، احمدوه،"
                     " عودوا السنتكم على الذكر فإنها إن اعتادت لن تصمت أبدًا.",
                     "- اللهم بلغنا رمضان وأجعلنا نختم القرآن واهدنا لبر الامان يالله يا رحمان 🌙",
                     "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العلي- ثلاث مرات -",
                     "- اللهم احرمني لذة معصيتك وارزقني لذة طاعتك 🌿💜.",
                     "- اللهُم إن في صوتي دُعاء وفي قلبِي أمنية اللهُم يسر لي الخير حيث كان.",
                     "‏اللهم أرني عجائب قدرتك في تيسير أموري 💜.",
                     "يغفر لمن يشاء إجعلني ممن تشاء يا الله.*",
                     "‏يارب إن قصّرنا في عبادتك فاغفرلنا، وإن سهينا عنك بمفاتن الدنيا فردنا إليك رداً جميلاً 💜🍀",
                     "صلوا على من قال في خطبة الوداع  ‏و إني مُباهٍ بكم الأمم يوم القيامة♥️⛅️",
                     "اللهـم إجعلنا ممن تشهد أصابعهم بذكـر الشهادة قبل الموت ??💜.",
                     "- وبك أصبحنا يا عظيم الشأن ??❤️.",
                     "اللهُم الجنة ونعيَّم الجنة مع من نحب💫❤️🌹",
                     "‏اللهم قلبًا سليمًا عفيفًا تقيًا نقيًا يخشاك سرًا وعلانية🤍🌱",
                     "- أسجِد لربِك وأحضِن الارض فِي ذِ  لاضَاق صَدرِك مِن هَموم المعَاصِي 🌿.",
                     "صلي على النبي بنيه الفرج❤️",
                     "استغفر ربنا كده 3 مرات هتاخد ثواب كبير اوى❤️",
                     "اشهد ان لا اله الا الله وان محمدا عبده ورسوله",
                     "لا اله الا الله سيدنا محمد رسول الله🌿💜",
                     "قول معايا - استغفر الله استفر الله استغفر الله -",
                     "مُجرد ثانية تنفعِك : أستغفُرالله العظيِم وأتوب إليّه.",
                     "أدعُ دُعاء الواثِق فالله لايُجرّبُ معه‌‏",
                     "صلي على محمد❤️",
                     "ماتيجو نقرء الفاتحه سوا🥺"]

@Client.on_message(filters.command(["ازكار","الازكار","❤️‍🔥ازكار"], ""), group=6971) 
async def azkar(client, message):
    
    a = random.choice(xt)
    await message.reply(f"{a}")
        
txkt = [

"‏من علامات جمال المرأة .. بختها المايل ! ",
"‏ انك الجميع و كل من احتل قلبي🫀🤍",
"‏ ‏ لقد تْعَمقتُ بكَ كَثيراً والمِيمُ لام .♥️",
"‏ ‏ممكن اكون اختارت غلط بس والله حبيت بجد🖇️",
"‏ علينا إحياء زَمن الرّسائل الورقيّة وسط هذه الفوضى الالكترونية العَارمة. ℘︙ 💜",
"‏ يجي اي الصاروخ الصيني ده جمب الصاروخ المصري لما بيلبس العبايه السوده.🤩♥️",
"‏ كُنت أرقّ من أن أتحمّل كُل تلك القَسوة من عَينيك .🍍",
"‏أَكَان عَلَيَّ أَنْ أغْرَس انيابي فِي قَلْبِك لتشعر بِي ؟.",
"‏ : كُلما أتبع قلبي يدلني إليك .",
"‏ : أيا ليت من تَهواه العينُ تلقاهُ .",
"‏ ‏: رغبتي في مُعانقتك عميقة جداً .??",
"ويُرهقني أنّي مليء بما لا أستطيع قوله.✨",
"‏ من مراتب التعاسه إطالة الندم ع شيء إنتهى. ℘︙ ",
"‏ ‏كل العالم يهون بس الدنيا بينا تصفي 💙",
"‏ بعض الاِعتذارات يجب أن تُرفَضّ.",
"‏ ‏تبدأ حياتك محاولاً فهم كل شيء، وتنهيها محاولاً النجاة من كل ما فهمت.",
"‏ إن الأمر ينتهي بِنا إلى أعتياد أي شيء.",
"‏ هل كانت كل الطرق تؤدي إليكِ، أم أنني كنتُ أجعلها كذلك.",
"‏ ‏هَتفضل تواسيهُم واحد ورا التاني لكن أنتَ هتتنسي ومحدِش هَيواسيك.",
"‏ جَبَرَ الله قلوبِكُم ، وقَلبِي .🍫",
"‏ بس لما أنا ببقى فايق، ببقى أبكم له ودان.💖",
"‏ ‏مقدرش عالنسيان ولو طال الزمن 🖤",
"‏ أنا لستُ لأحد ولا احد لي ، أنا إنسان غريب أساعد من يحتاجني واختفي.",
"‏ ‏أحببتك وأنا منطفئ، فما بالك وأنا في كامل توهجي ؟",
"‏ لا تعودني على دفء شمسك، إذا كان في نيتك الغروب .َ",
"‏ وانتهت صداقة الخمس سنوات بموقف.",
"‏ ‏لا تحب أحداً لِدرجة أن تتقبّل أذاه.",
"‏ إنعدام الرّغبة أمام الشّيء الّذي أدمنته ، انتصار.",
"‏مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !?? ",
" مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !💙",
"فـ بالله صبر  وبالله يسر وبالله عون وبالله كل شيئ ♥️. ",
"أنا بعتز بنفسي جداً كصاحب وشايف اللي بيخسرني ، بيخسر أنضف وأجدع شخص ممكن يشوفه . ",
"فجأه جاتلى قافله ‏خلتنى مستعد أخسر أي حد من غير ما أندم عليه . ",
"‏اللهُم قوني بك حين يقِل صبري... ",
"‏يارب سهِل لنا كُل حاجة شايلين هَمها 💙‏ ",
"انا محتاج ايام حلوه بقي عشان مش نافع كدا ! ",
"المشكله مش اني باخد قررات غلط المشكله اني بفكر كويس فيها قبل ما اخدها .. ",
"تخيل وانت قاعد مخنوق كدا بتفكر فالمزاكره اللي مزكرتهاش تلاقي قرار الغاء الدراسه .. ",
" مكانوش يستحقوا المعافرة بأمانه.",
"‏جمل فترة في حياتي، كانت مع اكثر الناس الذين أذتني نفسيًا. ",
" ‏إحنا ليه مبنتحبش يعني فينا اي وحش!",
"أيام مُمله ومستقبل مجهول ونومٌ غير منتظموالأيامُ تمرُ ولا شيَ يتغير ", 
"عندما تهب ريح المصلحه سوف ياتي الجميع رتكدون تحت قدمك ❤️. ",
"عادي مهما تعادي اختك قد الدنيا ف عادي ❤. ",
"بقيت لوحدي بمعنا اي انا اصلا من زمان لوحدي.❤️ ",
"- ‏تجري حياتنا بما لاتشتهي أحلامنا ! ",
"تحملين كل هذا الجمال، ‏ألا تتعبين؟",
"البدايات للكل ، والثبات للصادقين ",
"مُؤخرًا اقتنعت بالجملة دي جدا : Private life always wins. ",
" الافراط في التسامح بيخللي الناس تستهين بيك🍍",
"مهما كنت كويس فـَ إنت معرض لـِ الاستبدال.. ",
"فخوره بنفسي جدًا رغم اني معملتش حاجه فـ حياتي تستحق الذكر والله . ",
"‏إسمها ليلة القدر لأنها تُغير الأقدار ,اللهُمَّ غير قدري لحالٍ تُحبه وعوضني خير .. ",
"فى احتمال كبير انها ليلة القدر ادعوا لنفسكم كتير وأدعو ربنا يشفى كل مريض. 💙 ",
"أنِر ظُلمتي، وامحُ خطيئتي، واقبل توبتي وأعتِق رقبتي يا اللّٰه. إنكَ عفوٌّ تُحِبُّ العفوَ؛ فاعفُ عني 💛 "
        ]
        
@Client.on_message(filters.command(["كتبات","حكمه","❤️‍🔥حكمه"], ""), group=73973) 
async def ktbat(client, message):
    a = random.choice(txkt)
    await message.reply(f"{a}")
        
thdhbxt = [
            "هل تخربني اسم والدتك ما هو.",
            "ليك اسم شهره بتحبو ؟",
            "ممكن تعمل اي في حياتك",                        
            "انت راضي عن حياتك",            
            "اسم حببتك الاوله ايه",           
            "ما هو هدفك في الحياه",
            "كم مجموعك الدراسي",                      
            "ما هو الاكل المفضل لك",            
            "هل تحب سماع القران الكريم",           
            "هل تامن بالحب",
            "ماهو اخطر سر اليك",                    
            "هل تامن بالارتباط السوشيال",                       
            "متي ستتزوج",                        
            "هل تحب الفتيات ام الصبيان",                        
            "ماهو قولك عندما تره ما تحب",          
            "مانوع هاتفك الجوال",            
            "ماذا تفعل في الشتاء",                        
            "هل تحب والديك ام خوتك",                       
            "هل لك اسم شهره",                        
            "سبق و فعلت شي ندمان علي فعله",           
            "ما هو هدفك في الوقت الحالي",                        
            "ما اسم فلمك المفضل",                        
            "هل تحب الصراحه ام الكذب",                        
            "• أوصف نفسك بكلمة؟",                        
            "ممكن تقدم نصيحه لاحدهم بعنوان متغلطش غلطتي",           
            "تاريخ ميلادك ايه?",                        
            "مرتبط ولا سنجل ؟",          
            "انت بخير حاليا ؟",           
            "اسمك ايه",                        
            "منين داهيه",                        
            "عندك صحاب بنات",                        
            "عندك صحاب ولاد",                       
            "لونك المفضل",                       
            "جربت حاجه نجحت واي هي ؟",                        
            "رايك في البار",                        
            "مين اكتر حد بتحبه هنا",                      
            "هات رقمك",                        
            "بتحب المغامره",              
            "احسن حاجه حصلتلك الفتره دي",            
            "بتصلي",                        
            "كم فرد في الاسلام",                       
            "ممكن تقدم نصيحه لاحدهم بعنوان متغلطش غلطتي",                        
            "كم ركعه في صلاه العصر",                      
            "ما هيا اليلله التي خير من الف شهر",                        
            "سرقت قبل كدا",            
            "هل تحب الموسيقى",           
            "هل تحب مصر",            
            "لو الحمه غلت تاكل ايه",           
            "ايه رايك فيا كابوت موز",            
            "بتحب مين من الفنانين",                        
            "امك حلوه",                        
            "عندك كم اخ",                        
            "تقدر تنصح غيرك",                       
            "عاوز تعمل نصيبه امتي",                        
            "اي اللي مخليك فجروب الزباله دا",                      
            "لابس ايه دلوقتي",                        
            "لابسه ايه دلوقتي",                        
            "حد باسك قبل كدا",                        
            "بوست حد قبل كدا",                        
            "بتحب الفلوس",                        
            "بتحب الكشري",                        
            "نفسك تسافر فيه",                        
            "عالطلاق انت كحيااان",                        
            "بتعرف ترقص",                       
            "بتعرف تغني",                        
            "بتحب المدرسه",                        
            "ارتبط من المدرسه قبل كدا",                        
            "اكتر اتنين بتحب تخرج معاهم",                        
            "بتحب الفصح",                     
            "بتحب المناسبات",                        
            "بتحب الفول",                        
            "عاوز تخرج فين",                        
            "جربت تموت من الجوع قبل كدا",                        
            "بتحب تربي القطط",                        
            "مامتك عايشه",                        
            "ايه رايك في تليجرام",                        
            "ايه رايك في بت اللي فكول دي",                        
            "ايه رايك في اسعار في البلد",                       
            "ناوي تغير فونك امتي",                       
            "تعرف تشتم حد بتحبو",                        
            "بتحب الصعيد",                        
            "بتحب اسكندريه",                       
            "متابع ايه في مسلسلات التركي",                        
            "عندك واتساب",                        
            "ايه رايك في الشتاء",                       
            "ايه رايك في الصيف",                       
            "ايه رايك في الخريف",                       
            "كم فصل في سنه",                        
            "قاعد فين دلوقتي",                        
            "شربت حشيش قبل كدا",                       
            "بتشرب سجاير",                        
            "بتشربي سجاير",                        
            "عيط علي حاجه قبل كدا",           
            "بتنام امتي",                        
            "شغال ايه",                        
            "شغاله ايه",                        
            "بتحب شغالك",                        
            "نفسك تبقي غني",                        
            "بتعرف تخبي مشعارك",            
            "لون عيونك ايه",            
            "لون شعرك ايه",
             "حبيت كام مره 💏",             
                "اتعاكست كام مره☹️☹️",                
                "خونت كام مره 😈",                
                "موقف محرج حصلك😳",                
                "اكتر شخص حبيته وكسرك💔",                
                "شايف نفسك فين  بعد 5 سنين🤑",                
                "لو بقيت بنت ليوم اول حاجه هتعملها ايه والعكس لو بقيتي ولد ليوم اول حاجه هتعمليها ايه🤐🤐",                
                "اغرب موقف حصلك🤨",                
                "اقرب انسان لقلبك 💑",                
                "قولي اغلي 5 اشخاص في حياتك 👨‍👩‍👦‍👦",                
                "اوصف نفسك في كلمتين👼",                
                "لو ليك 3 امنيات هيبقوا ايه 🧚‍♂️🧚‍♀️",                
                "اكتر شخص بتحبه هنا مين😍",                
                "اوصف صاحب ليك في 3 كلمات😌",                
                "عاكست قبل كده وكان مين😘",                
                "اتخانت قبل كده ؟🤣",                
                "لو اتجبرت علي جواز صالونات هتوافق 👰🤵",                
                "لو هترتبط بحد في الروم هيبقي مين ??",                
                "اهلك بيدلعوك بيقولولك ايه 😁😁",               
                "صوتك حلو؟",                
                "لقيت الناس اللي بوشين؟",                
                "شيء وكنت تحقق اللسان؟",                
                "أنا شخص ضعيف عندما؟",                
                "هل ترغب في إظهار حبك ومرفق لشخص أو رؤية هذا الضعف؟",
                "هل الكذب يكون ضروري وقتا ما؟",                
                "أتشعر بالوحدة على الرغم انه يحاط بك الكثير من البشر؟",                
                "كيفية الكشف عن من يكمن عليك؟",               
                "إذا حاول شخص ما أن يكرهه أن يقترب منك ويهتم بك تعطيه فرصة؟",                
                "أشجع حاجه حلوه ف حياتك؟",                
                "طريقة جيدة يقنع حتى لو كانت الفكرة خاطئة"                 
                "كيف تتصرف مع من يسيئون فهمك ويأخذ على ذهنه ثم ينتظر أن يرفض؟",                
                "التغيير العادي عندما يكون الشخص الذي يحبه؟",               
                "المواقف الصعبة تضعف لك ولا ترفع؟",                
                "نظرة و يفسد الصداقة؟",                
                "‏‏لو حد قالك كلام سئ في الغالب اي رد فعلك؟",                
                "شخص معاك بالحلوه والمُره؟",                
                "‏هل تحب إظهار حبك وتعلقك بالشخص أم ترى ذلك ضعف؟",                
                "تاخد بكلام اللي ينصحك وماتعملش اللي انت عاوزة؟",               
                "اي تتمني الناس تعرفه عليك؟",                
                "ابيع المجرة عشان؟",                
                "أحيانا بحس ان الناس ، كمل؟",                
                "صدفة العمر الحلوة هي اني؟",             
                "الكُره العظيم دايم يجي بعد حُب قوي "
                "صفة تحبها في نفسك؟",               
                "‏الفقر فقر العقول ليس الجيوب "                
                "تصلي صلواتك الخمس كلها؟",                
                "‏تجامل أحد على راحتك؟",                
                "اشجع شيء عملته ف حياتك؟",                
                "ناوي تعمل اي النهارده؟",                
                "اي بيكون شعورك لما بتشوف المطر؟",
                "غيرتك هاديه ومابتعملش مشاكل؟",
                "اي اكتر حاجه ندمت عليها؟",
                "اي الدول اللي تتمنى تزورها؟",
                "اخره مره بكيت امتي؟",
                "تقييم حظك ؟ من عشره؟",
                "هل تعتقد ان حظك سيئ؟",
                "شـخــص تتمنــي الإنتقــام منـــه؟",
                "كلمة تود سماعها كل يوم؟",
                "**هل تُتقن عملك أم تشعر بالممل؟",
                "هل قمت بانتحال أحد الشخصيات لتكذب على من حولك؟",
                "متى آخر مرة قمت بعمل مُشكلة كبيرة وتسببت في خسائر؟",
                "ما هو اسوأ خبر سمعته بحياتك؟",                
                "‏ هل جرحت شخص تحبه من قبل ؟",               
                "ما هي العادة التي تُحب أن تبتعد عنها؟",
                "‏هل تحب عائلتك ام تكرههم؟",
                "‏من هو الشخص الذي يأتي في قلبك بعد الله – سبحانه وتعالى- ورسوله الكريم – صلى الله عليه وسلم؟",
                "‏هل خجلت من نفسك من قبل؟",                
                "‏ما هو ا الحلم الذي لم تستطيع ان تحققه؟",                
                "‏ما هو الشخص الذي تحلم به كل ليلة؟",              
                "‏هل تعرضت إلى موقف مُحرج جعلك تكره صاحبهُ؟",
                "‏هل قمت بالبكاء أمام من تُحب؟",              
                "‏ماذا تختار حبيبك أم صديقك؟",               
                "‏ هل حياتك سعيدة أم حزينة؟",                
                "ما هي أجمل سنة عشتها بحياتك؟",                
                "‏ما هو عمرك الحقيقي؟",                
                "ما هي أمنياتك المُستقبلية؟"
        ]
       
@Client.on_message(filters.command(["صراحه","اسال","سوال","اس","❤️‍🔥اسال"], ""), group=75583)
async def c5455utt(client, message):
    a = random.choice(thdhbxt)
    await message.reply(f"{a}")
        

tjgkgjhjxt = [
"واحد مشغول أتجوز واحدة مشغولة خلفوا عيل مش فاضيلهم 👻😹",
"مرة القمر كان عايز يتجوز الشمس قالتله أتجوز واحد صايع طول الليل 👻😹",
"ولد بيسأل أبوه هو الحب أعمى رد عليه أبوه بص في وش أمك وأنت تعرف 👻😹",
"مرة مفتاح مات أهله ما زعلوش عليه عشان معاهم نسخة تانية ??😹",
"ممرضة خلفت توأم سمت واحد عضل والتاني وليد 👻😹",
"مسطول أتجوز صينية قالتله مالك ساكت ليه؟ قالها مش عارف افتكرتك نايمة 👻😹",
"واحدة صعيدية جوزها رماها من الدور الثالث طلعتله وقالتله بلاش الهزار البايخ ده 👻😹",
"اتنين مساطيل حبوا يسرقوا عمارة فقالوا لبعض إحنا ناخد العمارة بعيد ونسرقها برحتنا 👻😹",
"منهم بص ورا ملقاش الهدوم فقال له كفاية كدة احنا بعدنا أوى 👻😹",
"حر جدًا، قالتله مفيش مشكلة نطلعها بالليل ??😹",
"واحد رجع في كلامه خبط اللي وراه 👻😹",
"واحد خلقه ضاق أعطاه لأخوه الصغير 👻😹",
"مرة مدرس رياضيات خلف ولدين واستنتج التالت 👻😹",
"واحد كهربائي أتجوز أربعة جابلهم مشترك 👻😹",
"كفايه عليك كده ياد يبن الحلوهه 👻😹",
"واحدة اسمها ساندي دخلت هندسة بقت ساندي متر مربع 👻😹",
"مرة شرطي مرور خلّف ولد بيتكلم بالإشارة 👻😹",
"مره واحد اسمو جابوا  كان بيرجم ابليس ف الحج قالولو ليه؟ قال عشان يمكن احتاجو 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه  👻😹",
"واحد بيشتكي لصاحبه بيقوله أنا مافيش حد بيحبني ولا يفتكرني أبدًا، ومش عارف أعمل إيه قاله سهلة استلف من الناس فلوس هيسألوا عليك كل يوم 👻😹",
" مرة واحد مصري دخل سوبر ماركت في الكويت عشان يشتري ولاعة راح عشان يحاسب بيقوله الولاعة ديه بكام قاله دينار قاله منا عارف ان هي نار بس بكام 👻😹",
"بنت حبت تشتغل مع رئيس عصابة شغلها في غسيل الأموال 👻😹",
"واحد بيشتكي لصاحبه بيقوله أنا مافيش حد بيحبني ولا يفتكرني أبدًا، ومش عارف أعمل إيه قاله سهلة استلف من الناس فلوس هيسألوا عليك كل يوم 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ؟ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه 👻😹",
"واحده ست سايقه على الجي بي اي قالها انحرفي قليلًا قلعت الطرحة 👻😹",
"مرة واحد غبي معاه عربية قديمة جدًا وبيحاول يبيعها وماحدش راضي يشتريها.. راح لصاحبه حكاله المشكلة صاحبه قاله عندي لك فكرة جهنمية هاتخليها تتباع الصبح أنت تجيب علامة مرسيدس وتحطها عليها. بعد أسبوعين صاحبه شافه صدفة قاله بعت العربية ولا لاء؟ قاله انت  مجنون حد يبيع مرسيدس 👻😹",
"مره واحد بلديتنا كان بيدق مسمار فى الحائط فالمسمار وقع منه فقال له :تعالى ف مجاش, فقال له: تعالي ف مجاش. فراح بلديتنا رامي على المسمار شوية مسمامير وقال: هاتوه 👻😹",
"واحدة عملت حساب وهمي ودخلت تكلم جوزها منه ومبسوطة أوي وبتضحك سألوها بتضحكي على إيه قالت لهم أول مرة يقول لي كلام حلو من ساعة ما اتجوزنا 👻😹",
"بنت حبت تشتغل مع رئيس عصابة شغلها في غسيل الأموال 👻😹",
"مره واحد اشترى فراخ علشان يربيها فى قفص صدره 👻😹",
"مرة واحد من الفيوم مات اهله صوصوا عليه 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه 👻😹",
"مره واحد شاط كرة فى المقص اتخرمت. 👻😹",
"مرة واحد رايح لواحد صاحبهفا البواب وقفه بيقول له انت طالع لمين قاله طالع أسمر شوية لبابايا قاله يا أستاذ طالع لمين في العماره 👻😹",
" وهه عاوز تانيي 👻😹 "
        ]

@Client.on_message(filters.command(["نكته","❤️‍🔥نكته"], ""), group=7380)
async def nokt(client, message):
    a = random.choice(tjgkgjhjxt)
    await message.reply(
        f"{a}")

txjfjvkbkvt = [
" اتحداك تقول سر محدش يعرفو", 
" تحداك تطلع تغني ف الكول،🤡", 
" اتحداك تقفل الكول🤡🌟", 
" اتحداك تقول حاجه محدش يعرفها عن صاحب البار،🤡", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تتصل بمطعم وتقوله عايز بيبرونة😂♥🤡", 
" اتحداك تخرج من كل الجروبات ال عندك 😂♥️", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" اتحداك تحكي شويه عن شخصيتك 🤡🌟", 
" اتحداك تجيب اسكرين من سيرش جوجل بتاعك😂♥", 
" اتحداك تغير صورة البروفايل زي بتاعتي", 
" اتحداك تقولي امك اسمها اي 😹♥️", 
" اتحداك تقطع 10 جنيه دلوقتي😂♥", 
" اتحداك تقفل الكول🤡🌟", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تبعت اخر سكرين شوت عندك 😹♥", 
" اتحداك تقولي امك اسمها اي 😹♥️", 
" اتحداك تقول لحد دا امك اسمها اي", 
" اتحداك تقول اكتر اكله بتحبها🤡😹", 
" اتحداك تقول اسم البيست فريند❤️😹", 
" اعمل منشن لوحده وقولها هاتي رقمك 😂♥️", 
" اتحداك تمنشن لواحد كلاون 🤡", 
" اتحداك تدخل الكول وتقولهم بصوت عالي انا حامل 😂♥️", 
" اتحداك تجيب سكرين شوت ل شات اكتر حد بتضحك معاه 😂♥️", 
" اتحداك تقول لحد دا امك اسمها اي", 
" اتحداك تغني في ريكورد وتبعتو", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" لو راجل قولي انت مرتبط بكام وحده دلوقتي 😂♥️", 
" اتحداك تبعتلي صوره حبيبتك 😂♥️", 
" غنيلي اغنيه ل حمو بيكا 😂♥️", 
" اتحداك تمنشن لحد وتقوله انت حكاك❤️😹", 
" اتحداك تمنشن اطيب واحد هنا🤡??", 
" اتحداك تقول مين الي انت بتكراش عليها هنا ♥️😹", 
" اتحداك تقول اسم حبيبتك", 
" اتحداك تقول اخر رساله جاتلك من مين", 
" اتحداك تبعت رقمك 😂♥️", 
" اتحداك تقول اسم حبيبتك", 
" اتحداك تقفل الكول 😂♥️", 
" اتحداك تقوم تصلي دلوقتي ♥️", 
" اتحداك تمنشن لحد وتقوله انت حكاك❤️😹", 
" اتحداك تقول لحد امك رقاصه", 
" اتحداك تجيب سكرين شوت ل شات اكتر حد بتضحك معاه 😂♥️", 
" اتحداك تمنشن لواحده وتقولها تيجي نتجوز ❤️😹", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" اتحداك تجيب اسكرين من سيرش جوجل بتاعك😂♥", 
" اتحداك تقول اسم اغلي صاحب بتحبه❤️😹", 
" اتحداك تمنشن اكتر واحد شايفه م محترم😹🤡", 
" اتحداك تحذف تلي دلوقتي 😂♥️", 
" اتحداك تقول بحبك لخمس منشن😂😉", 
" اتحداك تقفل الكول 😂♥️", 
" اتحداك تغني لحسن شاكوش❤️😹", 
" اتحداك تقول رايك عن السوشيال ميديا 🤡", 
"ا تحداك تتكلم بلهجة مختلفة لمدة دقيق😂♥", 
" اتحداك تعمل منشن لحد وتقول نكته سخيفة😂♥", 
" اتحداك تصور نفسك دلوقتي وتبعتها", 
" اتحداك تقول لاي حد بحبك", 
" اتحداك تنزل واقع وتقابلني 😂❤️", 
" اتحداك تقطع الهاند بتاعتك دلوقتي😂♥", 
" اتحداك تقول اخر رساله جاتلك من مين", 
" اتحداك تفتح كام وتقول كبسو كبسو🤡😹", 
" اتحداك تقوم تصلي دلوقتي ♥️", 
" اتحداك تقول انا م راجل 😹🤡", 
" اتحداك تقول مواصفات فتاة احلامك😹🩶", 
" اتحداك تطلع الكول ترقص عقباوي 😂♥️", 
" اتحداك تمنشن لواحده وتقولها امك حماتي❤️😹", 
" اتحداك تقول للقيصر بحبك 😹♥", 
" اتحداك ترمي نفسك من البلكونة 😂♥", 
" اتحداك تقولي عندك كام اكس ف حياتك 😹♥️", 
" اتحداك تقول ع عاده بتحب تعملها❤️😹", 
" اتحداك تقطع الهاند بتاعتك دلوقتي😂♥", 
" اتحداك تمنشن لواحده وتقولها امك حماتي❤️😹", 
" اتحداك تبعت اسكرين لشات اكتر واحد بتكلمه❤️😹", 
" اتحداك تقول اسم بنت معرفتش تشقطها ♥️😹", 
" اتحداك تقول مين اخر حد بعتلك رساله", 
" اتحداك تمنشن اكتر واحد شايفه م محترم😹🤡", 
" صلي على النبي وتبسم ♥️✨", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تمنشن لحد وتقوله ارقلصي😂♥", 
" اتحداك تمنشن لحد وتقوله ارقلصي😂♥", 
" اتحداك تغني لحسن شاكوش❤️😹", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تعمل منشن لحد وتقول نكته سخيفة😂♥", 
" اتحداك تبعت رقم امك😂♥", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تعمل منشن لواحد وتقولو تعال نرتبط 😂♥️", 
" اتحداك تقول بتعمل اي ف اوقات فراغك🤡😹", 
" اتحداك تقول موقف حصلك ومش قادر تنساه ♥️😹", 
" اتحداك تحط البايو بحبك الى مغلبنى 10 دقايق ??↫ᶜᵃᵉˢᵃʳ", 
" اتحداك تسال صحبك رأيه ف شخصيتك وتصرفاتك🤡🌟",

        ]

@Client.on_message(filters.command(["تحدي"], ""), group=75543)
async def caes253ar(client, message):
    a = random.choice(txjfjvkbkvt)
    await message.reply(f"{a}")    
    
    

@Client.on_message(filters.command(["زخرفه"], ""), group=53)
async def zahrafa(client, m):
    ask = await client.ask(m.chat.id, "حسنا قم بارسال الاسم لزخرفته ✨♥", reply_to_message_id=m.id, filters=filters.user(m.from_user.id), timeout=200)
    text = ask.text
    if len(text) > 100:
        await m.reply_text("◍ لا يمكنك تشكيل أكثر من 100 حرفاً، يرجى المحاولة مرة أخرى!\n√")
        return
    else:
        if re.match("\n", str(text)):
            await m.reply_text("◍ لا يمكن زخرفه نص يحتوي على اكثر من سطر\n√")
            return
    EmojeS = [
        ' 𓁻 ',
        ' 𓏴  ',
        ' 𓏶 ',
        ' 𓏡 ',
        ' 𓏢 ',
        ' 𓏣 ',
        ' ☽ ',
        ' 𖠱 ',
        '☂ ',
        ' ◑ ',
        ' ꧁ ',
        ' ◌ ',
        ' ★ ',
        ' ℡ ',
        ' § ',
        ' ☆ '
    ]
    Emoje = [
        ' ♕ ',
        ' 𖤍 ',
        ' 𖤓 ',
        ' ✾ ',
        ' ♡ ',
        ' ꧂ ',
        ' ☫: ',
        ' ♫ ',
        ' ❈ ',
        ' ➽ ',
        ' ✺ ',
        ' ⚘ ',
        ' 𖤐 ',
        ' ❣ ',
        ' ❿ '
    ]

    zhrf = re.sub('ض', 'ضِٰـِۢ', text)
    zhrf = re.sub('ص', 'صِٰـِۢ', zhrf)
    zhrf = re.sub('ث', 'ثِٰـِۢ', zhrf)
    zhrf = re.sub('ق', 'قِٰـِۢ', zhrf)
    zhrf = re.sub('ف', 'فِٰ͒ـِۢ', zhrf)
    zhrf = re.sub('غ', 'غِٰـِۢ', zhrf)
    zhrf = re.sub('ع', 'عِٰـِۢ', zhrf)
    zhrf = re.sub('خ', 'خِٰ̐ـِۢ', zhrf)
    zhrf = re.sub('ح', 'حِٰـِۢ', zhrf)
    zhrf = re.sub('ج', 'جِٰـِۢ', zhrf)
    zhrf = re.sub('ش', 'شِٰـِۢ', zhrf)
    zhrf = re.sub('س', 'سِٰـِۢ', zhrf)
    zhrf = re.sub('ي', 'يِٰـِۢ', zhrf)
    zhrf = re.sub('ب', 'بِٰـِۢ', zhrf)
    zhrf = re.sub('ل', 'لِٰـِۢ', zhrf)
    zhrf = re.sub('ا', 'آ', zhrf)
    zhrf = re.sub('ت', 'تِٰـِۢ', zhrf)
    zhrf = re.sub('ن', 'نِٰـِۢ', zhrf)
    zhrf = re.sub('م', 'مِٰـِۢ', zhrf)
    zhrf = re.sub('ك', 'ڪِٰـِۢ', zhrf)
    zhrf = re.sub('ط', 'طِٰـِۢ', zhrf)
    zhrf = re.sub('ظ', 'ظِٰـِۢ', zhrf)
    zhrf = re.sub('ء', 'ء', zhrf)
    zhrf = re.sub('ؤ', 'ؤ', zhrf)
    zhrf = re.sub('ر', 'ر', zhrf)
    zhrf = re.sub('ى', 'ى', zhrf)
    zhrf = re.sub('ز', 'ز', zhrf)
    zhrf = re.sub('و', 'ﯛ̲୭', zhrf)
    zhrf = re.sub('ه', 'ۿۿہ', zhrf)
    zhrf = re.sub('a', '𝗮', zhrf)
    zhrf = re.sub('A', '𝗔', zhrf)
    zhrf = re.sub("b", "𝗯", zhrf)
    zhrf = re.sub("B", "𝗕", zhrf)
    zhrf = re.sub("c", "𝗰", zhrf)
    zhrf = re.sub("C", "𝗖", zhrf)
    zhrf = re.sub("d", "𝗱", zhrf)
    zhrf = re.sub("D", "𝗗", zhrf)
    zhrf = re.sub("e", "𝗲", zhrf)
    zhrf = re.sub("E", "𝗘", zhrf)
    zhrf = re.sub("f", "𝗳", zhrf)
    zhrf = re.sub("F", "𝗙", zhrf)
    zhrf = re.sub("g", "𝗴", zhrf)
    zhrf = re.sub("G", "𝗚", zhrf)
    zhrf = re.sub("h", "𝗵", zhrf)
    zhrf = re.sub("H", "𝗛", zhrf)
    zhrf = re.sub("i", "𝗹", zhrf)
    zhrf = re.sub("I", "𝗜", zhrf)
    zhrf = re.sub("j", "𝗝", zhrf)
    zhrf = re.sub("J", "𝗝", zhrf)
    zhrf = re.sub("k", "𝗸", zhrf)
    zhrf = re.sub("K", "𝗞", zhrf)
    zhrf = re.sub("l", "𝗹", zhrf)
    zhrf = re.sub("L", "𝗟", zhrf)
    zhrf = re.sub("m", "𝗺", zhrf)
    zhrf = re.sub("M", "𝗠", zhrf)
    zhrf = re.sub("n", "𝗻", zhrf)
    zhrf = re.sub("N", "𝗡", zhrf)
    zhrf = re.sub("o", "𝗼", zhrf)
    zhrf = re.sub("O", "𝗢", zhrf)
    zhrf = re.sub("p", "𝗽", zhrf)
    zhrf = re.sub("P", "𝗣", zhrf)
    zhrf = re.sub("q", "𝗾", zhrf)
    zhrf = re.sub("Q", "𝗤", zhrf)
    zhrf = re.sub("r", "𝗿", zhrf)
    zhrf = re.sub("R", "𝗥", zhrf)
    zhrf = re.sub("s", "𝘀", zhrf)
    zhrf = re.sub("S", "𝗦", zhrf)
    zhrf = re.sub("t", "𝘁", zhrf)
    zhrf = re.sub("T", "𝗧", zhrf)
    zhrf = re.sub("u", "𝘂", zhrf)
    zhrf = re.sub("U", "𝗨", zhrf)
    zhrf = re.sub("v", "𝘃", zhrf)
    zhrf = re.sub("V", "𝗩", zhrf)
    zhrf = re.sub("w", "𝘄", zhrf)
    zhrf = re.sub("W", "𝗪", zhrf)
    zhrf = re.sub("x", "𝘅", zhrf)
    zhrf = re.sub("X", "𝗫", zhrf)
    zhrf = re.sub("y", "𝘆", zhrf)
    zhrf = re.sub("Y", "𝗬", zhrf)
    zhrf = re.sub("z", "𝘇", zhrf)
    zhrf = re.sub("Z", "𝗭", zhrf)

    zhrf2 = re.sub('ض', 'ضَٰـُـٰٓ', text)
    zhrf2 = re.sub('ص', 'صَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ث', 'ثَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ق', 'قَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ف', 'فَٰ͒ـُـٰٓ', zhrf2)
    zhrf2 = re.sub('غ', 'غَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ع', 'عَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('خ', 'خَٰ̐ـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ح', 'حَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ج', 'جَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ش', 'شَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('س', 'سَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ي', 'يَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ب', 'بَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ل', 'لَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ا', 'آ', zhrf2)
    zhrf2 = re.sub('ت', 'تَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ن', 'نَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('م', 'مَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ك', 'ڪَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ط', 'طَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ظ', 'ظَٰـُـٰٓ', zhrf2)
    zhrf2 = re.sub('ء', 'ء', zhrf2)
    zhrf2 = re.sub('ؤ', 'ؤ', zhrf2)
    zhrf2 = re.sub('ر', 'ر', zhrf2)
    zhrf2 = re.sub('ى', 'ى', zhrf2)
    zhrf2 = re.sub('ز', 'ز', zhrf2)
    zhrf2 = re.sub('و', 'ﯛ̲୭', zhrf2)
    zhrf2 = re.sub("ه", "ۿۿہ", zhrf2)
    zhrf2 = re.sub('a', "𝖆", zhrf2)
    zhrf2 = re.sub('A', "𝖆", zhrf2)
    zhrf2 = re.sub("b", "??", zhrf2)
    zhrf2 = re.sub("B", "𝖇", zhrf2)
    zhrf2 = re.sub("c", "𝖈", zhrf2)
    zhrf2 = re.sub("C", "𝖈", zhrf2)
    zhrf2 = re.sub("d", "𝖉", zhrf2)
    zhrf2 = re.sub("D", "𝖉", zhrf2)
    zhrf2 = re.sub("e", "𝖊", zhrf2)
    zhrf2 = re.sub("E", "𝖊", zhrf2)
    zhrf2 = re.sub("f", "𝖋", zhrf2)
    zhrf2 = re.sub("F", "𝖋", zhrf2)
    zhrf2 = re.sub("g", "??", zhrf2)
    zhrf2 = re.sub("G", "𝖌", zhrf2)
    zhrf2 = re.sub("h", "𝖍", zhrf2)
    zhrf2 = re.sub("H", "𝖍", zhrf2)
    zhrf2 = re.sub("i", "𝖎", zhrf2)
    zhrf2 = re.sub("I", "𝖎", zhrf2)
    zhrf2 = re.sub("j", "𝖏", zhrf2)
    zhrf2 = re.sub("J", "𝖏", zhrf2)
    zhrf2 = re.sub("k", "𝖐", zhrf2)
    zhrf2 = re.sub("K", "𝖐", zhrf2)
    zhrf2 = re.sub("l", "𝖑", zhrf2)
    zhrf2 = re.sub("L", "𝖑", zhrf2)
    zhrf2 = re.sub("m", "𝖒", zhrf2)
    zhrf2 = re.sub("M", "𝖒", zhrf2)
    zhrf2 = re.sub("n", "𝖓", zhrf2)
    zhrf2 = re.sub("N", "𝖓", zhrf2)
    zhrf2 = re.sub("o", "𝖔", zhrf2)
    zhrf2 = re.sub("O", "𝖔", zhrf2)
    zhrf2 = re.sub("p", "𝖕", zhrf2)
    zhrf2 = re.sub("P", "𝖕", zhrf2)
    zhrf2 = re.sub("q", "𝖖", zhrf2)
    zhrf2 = re.sub("Q", "𝖖", zhrf2)
    zhrf2 = re.sub("r", "𝖗", zhrf2)
    zhrf2 = re.sub("R", "𝖗", zhrf2)
    zhrf2 = re.sub("s", "𝖘", zhrf2)
    zhrf2 = re.sub("S", "𝖘", zhrf2)
    zhrf2 = re.sub("t", "𝖙", zhrf2)
    zhrf2 = re.sub("T", "𝖙", zhrf2)
    zhrf2 = re.sub("u", "𝖚", zhrf2)
    zhrf2 = re.sub("U", "𝖚", zhrf2)
    zhrf2 = re.sub("v", "𝖛", zhrf2)
    zhrf2 = re.sub("V", "𝖛", zhrf2)
    zhrf2 = re.sub("w", "𝖜", zhrf2)
    zhrf2 = re.sub("W", "𝖜", zhrf2)
    zhrf2 = re.sub("x", "𝖝", zhrf2)
    zhrf2 = re.sub("X", "𝖝", zhrf2)
    zhrf2 = re.sub("y", "𝖞", zhrf2)
    zhrf2 = re.sub("Y", "𝖞", zhrf2)
    zhrf2 = re.sub("z", "𝖟", zhrf2)
    zhrf2 = re.sub("Z", "𝖟", zhrf2)

    zhrf3 = re.sub('ض', 'ض', text)
    zhrf3 = re.sub('ص', 'ص', zhrf3)
    zhrf3 = re.sub('ث', 'ثہ', zhrf3)
    zhrf3 = re.sub('ق', 'ق', zhrf3)
    zhrf3 = re.sub('ف', 'فُہ', zhrf3)
    zhrf3 = re.sub('غ', 'غہ', zhrf3)
    zhrf3 = re.sub('ع', 'عہ', zhrf3)
    zhrf3 = re.sub('ه', 'هٰہٰٖ', zhrf3)
    zhrf3 = re.sub('خ', 'خہ', zhrf3)
    zhrf3 = re.sub('ح', 'حہ', zhrf3)
    zhrf3 = re.sub('ج', 'جہ', zhrf3)
    zhrf3 = re.sub('د', 'د', zhrf3)
    zhrf3 = re.sub('ذ', 'ذ', zhrf3)
    zhrf3 = re.sub('ش', 'شہ', zhrf3)
    zhrf3 = re.sub('س', 'سہ', zhrf3)
    zhrf3 = re.sub('ي', 'يہ', zhrf3)
    zhrf3 = re.sub('ب', 'بّ', zhrf3)
    zhrf3 = re.sub('ل', 'لہ', zhrf3)
    zhrf3 = re.sub('ا', 'ا', zhrf3)
    zhrf3 = re.sub('ت', 'تہ', zhrf3)
    zhrf3 = re.sub('ن', 'نٰہٰٖ', zhrf3)
    zhrf3 = re.sub('م', 'مٰہٰٖ', zhrf3)
    zhrf3 = re.sub('ك', 'كُہ', zhrf3)
    zhrf3 = re.sub('ط', 'طہ', zhrf3)
    zhrf3 = re.sub('ئ', 'ئ ْٰ', zhrf3)
    zhrf3 = re.sub('ء', 'ء', zhrf3)
    zhrf3 = re.sub('ؤ', 'ؤ', zhrf3)
    zhrf3 = re.sub('ر', 'رَ', zhrf3)
    zhrf3 = re.sub('لا', 'لہا', zhrf3)
    zhrf3 = re.sub('ى', 'ىْ', zhrf3)
    zhrf3 = re.sub('ة', 'ة', zhrf3)
    zhrf3 = re.sub('و', 'و', zhrf3)
    zhrf3 = re.sub('ز', 'ز', zhrf3)
    zhrf3 = re.sub('ظ', 'ظۗہٰٰ', zhrf3)
    zhrf3 = re.sub('q', '𝐪', zhrf3)
    zhrf3 = re.sub('Q', '𝐪', zhrf3)
    zhrf3 = re.sub('w', '𝐰', zhrf3)
    zhrf3 = re.sub('W', '𝐰', zhrf3)
    zhrf3 = re.sub('e', '𝐞', zhrf3)
    zhrf3 = re.sub('E', '𝐞', zhrf3)
    zhrf3 = re.sub('r', '𝐫', zhrf3)
    zhrf3 = re.sub('R', '𝐫', zhrf3)
    zhrf3 = re.sub('t', '𝐭', zhrf3)
    zhrf3 = re.sub('T', '𝐭', zhrf3)
    zhrf3 = re.sub('y', '𝐲', zhrf3)
    zhrf3 = re.sub('Y', '𝐲', zhrf3)
    zhrf3 = re.sub('u', '𝐮', zhrf3)
    zhrf3 = re.sub('i', '𝐢', zhrf3)
    zhrf3 = re.sub('o', '𝐨', zhrf3)
    zhrf3 = re.sub('p', '𝐩', zhrf3)
    zhrf3 = re.sub('a', '𝐚', zhrf3)
    zhrf3 = re.sub('s', '𝐬', zhrf3)
    zhrf3 = re.sub('d', '??', zhrf3)
    zhrf3 = re.sub('f', '𝐟', zhrf3)
    zhrf3 = re.sub('g', '𝐠', zhrf3)
    zhrf3 = re.sub('h', '𝐡', zhrf3)
    zhrf3 = re.sub('j', '𝐣', zhrf3)
    zhrf3 = re.sub('k', '𝐤', zhrf3)
    zhrf3 = re.sub('U', '𝐮', zhrf3)
    zhrf3 = re.sub('I', '𝐢', zhrf3)
    zhrf3 = re.sub('O', '𝐨', zhrf3)
    zhrf3 = re.sub('P', '𝐩', zhrf3)
    zhrf3 = re.sub('A', '𝐚', zhrf3)
    zhrf3 = re.sub('S', '𝐬', zhrf3)
    zhrf3 = re.sub('D', '𝐝', zhrf3)
    zhrf3 = re.sub('F', '𝐟', zhrf3)
    zhrf3 = re.sub('G', '𝐠', zhrf3)
    zhrf3 = re.sub('H', '𝐡', zhrf3)
    zhrf3 = re.sub('J', '𝐣', zhrf3)
    zhrf3 = re.sub('K', '𝐤', zhrf3)
    zhrf3 = re.sub('L', '𝐥', zhrf3)
    zhrf3 = re.sub('l', '𝐥', zhrf3)
    zhrf3 = re.sub('z', '𝐳', zhrf3)
    zhrf3 = re.sub('Z', '𝐳', zhrf3)
    zhrf3 = re.sub('x', '𝐱', zhrf3)
    zhrf3 = re.sub('X', 'ẋ', zhrf3)
    zhrf3 = re.sub('c', '𝐜', zhrf3)
    zhrf3 = re.sub('C', '𝐜', zhrf3)
    zhrf3 = re.sub('v', '𝐯', zhrf3)
    zhrf3 = re.sub('V', '𝐯', zhrf3)
    zhrf3 = re.sub('b', '𝐛', zhrf3)
    zhrf3 = re.sub('B', '𝐛', zhrf3)
    zhrf3 = re.sub('n', '𝐧', zhrf3)
    zhrf3 = re.sub('N', '𝐧', zhrf3)
    zhrf3 = re.sub('m', '𝐦', zhrf3)
    zhrf3 = re.sub('M', '𝐦', zhrf3)

    zhrf4 = re.sub('ض', 'ضۜہٰٰ', text)
    zhrf4 = re.sub('ص', 'ضۜہٰٰ', zhrf4)
    zhrf4 = re.sub('ث', 'ثہٰٰ', zhrf4)
    zhrf4 = re.sub('ق', 'قྀ̲ہٰٰ', zhrf4)
    zhrf4 = re.sub('ف', 'ف͒ہٰٰ', zhrf4)
    zhrf4 = re.sub('غ', 'غہٰٰ', zhrf4)
    zhrf4 = re.sub('ع', 'عہٰٰ', zhrf4)
    zhrf4 = re.sub('ه', 'هٰہٰٖ', zhrf4)
    zhrf4 = re.sub('خ', 'خٰ̐ہ ', zhrf4)
    zhrf4 = re.sub('ح', 'حہٰٰ', zhrf4)
    zhrf4 = re.sub('ج', 'جـٰ̲ـہْۧ', zhrf4)
    zhrf4 = re.sub('د', 'دٰ', zhrf4)
    zhrf4 = re.sub('ذ', 'ذِٰ', zhrf4)
    zhrf4 = re.sub('ش', 'شِٰہٰٰ', zhrf4)
    zhrf4 = re.sub('س', 'سٰٓ', zhrf4)
    zhrf4 = re.sub('ي', 'يِٰہ', zhrf4)
    zhrf4 = re.sub('ب', 'بّہ', zhrf4)
    zhrf4 = re.sub('ل', 'لـٰ̲ـہ', zhrf4)
    zhrf4 = re.sub('ا', 'آ', zhrf4)
    zhrf4 = re.sub('ت', 'تَہَٰ', zhrf4)
    zhrf4 = re.sub('ن', 'نَِہ', zhrf4)
    zhrf4 = re.sub('م', 'مٰ̲ہ', zhrf4)
    zhrf4 = re.sub('ك', 'ڪٰྀہٰٰ', zhrf4)
    zhrf4 = re.sub('ط', 'طۨہٰٰ', zhrf4)
    zhrf4 = re.sub('ئ', 'ئ ْٰ', zhrf4)
    zhrf4 = re.sub('ء', 'ء', zhrf4)
    zhrf4 = re.sub('ؤ', 'ؤ', zhrf4)
    zhrf4 = re.sub('ر', 'رَ', zhrf4)
    zhrf4 = re.sub('لا', 'لہا', zhrf4)
    zhrf4 = re.sub('ى', 'ىْ', zhrf4)
    zhrf4 = re.sub('ة', 'ة', zhrf4)
    zhrf4 = re.sub('و', 'وِٰ', zhrf4)
    zhrf4 = re.sub('ز', 'زَٰ', zhrf4)
    zhrf4 = re.sub('ظ', 'ظۗہٰٰ', zhrf4)
    zhrf4 = re.sub('q', '𝑸', zhrf4)
    zhrf4 = re.sub('Q', '𝑸', zhrf4)
    zhrf4 = re.sub('w', '𝑾', zhrf4)
    zhrf4 = re.sub('W', '𝑾', zhrf4)
    zhrf4 = re.sub('e', '𝑬', zhrf4)
    zhrf4 = re.sub('E', '𝑬', zhrf4)
    zhrf4 = re.sub('r', '𝑹', zhrf4)
    zhrf4 = re.sub('R', '𝑹', zhrf4)
    zhrf4 = re.sub('t', '𝑻', zhrf4)
    zhrf4 = re.sub('T', '𝑻', zhrf4)
    zhrf4 = re.sub('y', '𝒀', zhrf4)
    zhrf4 = re.sub('Y', '𝒀', zhrf4)
    zhrf4 = re.sub('u', '𝑼', zhrf4)
    zhrf4 = re.sub('U', '𝑼', zhrf4)
    zhrf4 = re.sub('i', '𝑰', zhrf4)
    zhrf4 = re.sub('I', '𝑰', zhrf4)
    zhrf4 = re.sub('o', '𝑶', zhrf4)
    zhrf4 = re.sub('O', '𝑶', zhrf4)
    zhrf4 = re.sub('p', '𝑷', zhrf4)
    zhrf4 = re.sub('P', '𝑷', zhrf4)
    zhrf4 = re.sub('a', '𝑨', zhrf4)
    zhrf4 = re.sub('A', '𝑨', zhrf4)
    zhrf4 = re.sub('s', '𝑺', zhrf4)
    zhrf4 = re.sub('S', '𝑺', zhrf4)
    zhrf4 = re.sub('d', '??', zhrf4)
    zhrf4 = re.sub('D', '𝑫', zhrf4)
    zhrf4 = re.sub('f', '𝑭', zhrf4)
    zhrf4 = re.sub('F', '𝑭', zhrf4)
    zhrf4 = re.sub('g', '𝑮', zhrf4)
    zhrf4 = re.sub('G', '𝑮', zhrf4)
    zhrf4 = re.sub('h', '𝑯', zhrf4)
    zhrf4 = re.sub('H', '𝑯', zhrf4)
    zhrf4 = re.sub('j', '𝑱', zhrf4)
    zhrf4 = re.sub('J', '??', zhrf4)
    zhrf4 = re.sub('k', '𝑲', zhrf4)
    zhrf4 = re.sub('K', '𝑲', zhrf4)
    zhrf4 = re.sub('l', '𝑳', zhrf4)
    zhrf4 = re.sub('L', '𝑳', zhrf4)
    zhrf4 = re.sub('z', '𝒁', zhrf4)
    zhrf4 = re.sub('Z', '𝒁', zhrf4)
    zhrf4 = re.sub('x', '𝑿', zhrf4)
    zhrf4 = re.sub('X', '𝑿', zhrf4)
    zhrf4 = re.sub('c', '𝑪', zhrf4)
    zhrf4 = re.sub('C', '𝑪', zhrf4)
    zhrf4 = re.sub('v', '𝑽', zhrf4)
    zhrf4 = re.sub('V', '𝑽', zhrf4)
    zhrf4 = re.sub('b', '𝑩', zhrf4)
    zhrf4 = re.sub('B', '𝑩', zhrf4)
    zhrf4 = re.sub('n', '𝑵', zhrf4)
    zhrf4 = re.sub('N', '𝑵', zhrf4)
    zhrf4 = re.sub('m', '𝑴', zhrf4)
    zhrf4 = re.sub('M', '𝑴', zhrf4)

    zhrf5 = re.sub('ض', 'ضَ', text)
    zhrf5 = re.sub('ص', 'صً', zhrf5)
    zhrf5 = re.sub('ث', 'ثَ', zhrf5)
    zhrf5 = re.sub('ق', 'قُ', zhrf5)
    zhrf5 = re.sub('ف', 'فّ', zhrf5)
    zhrf5 = re.sub('غ', 'غِ', zhrf5)
    zhrf5 = re.sub('ع', 'عُ', zhrf5)
    zhrf5 = re.sub('ه', 'ﮭ', zhrf5)
    zhrf5 = re.sub('خ', 'خِ', zhrf5)
    zhrf5 = re.sub('ح', 'حٌ', zhrf5)
    zhrf5 = re.sub('ج', 'جُ', zhrf5)
    zhrf5 = re.sub('د', 'دِ', zhrf5)
    zhrf5 = re.sub('ذ', 'ذَ', zhrf5)
    zhrf5 = re.sub('ش', 'شِ', zhrf5)
    zhrf5 = re.sub('س', 'سً', zhrf5)
    zhrf5 = re.sub('ي', 'يْ', zhrf5)
    zhrf5 = re.sub('ب', 'بّ', zhrf5)
    zhrf5 = re.sub('ل', 'لَ', zhrf5)
    zhrf5 = re.sub('ا', 'أُ', zhrf5)
    zhrf5 = re.sub('ت', 'تٌ', zhrf5)
    zhrf5 = re.sub('ن', 'نً', zhrf5)
    zhrf5 = re.sub('م', 'مِ', zhrf5)
    zhrf5 = re.sub('ك', 'ڳّ', zhrf5)
    zhrf5 = re.sub('ط', 'طٌ', zhrf5)
    zhrf5 = re.sub('ئ', 'ئ', zhrf5)
    zhrf5 = re.sub('ء', 'ء', zhrf5)
    zhrf5 = re.sub('ؤ', 'ؤ', zhrf5)
    zhrf5 = re.sub('ر', 'رٌ', zhrf5)
    zhrf5 = re.sub('لا', 'لٌأً', zhrf5)
    zhrf5 = re.sub('ى', 'ى', zhrf5)
    zhrf5 = re.sub('ة', 'ةَ', zhrf5)
    zhrf5 = re.sub('و', 'وِ', zhrf5)
    zhrf5 = re.sub('ز', 'زُ', zhrf5)
    zhrf5 = re.sub('ظ', 'ظ', zhrf5)
    zhrf5 = re.sub('q', '𝒒', zhrf5)
    zhrf5 = re.sub('Q', '𝒒', zhrf5)
    zhrf5 = re.sub('w', '𝒘', zhrf5)
    zhrf5 = re.sub('W', '𝒘', zhrf5)
    zhrf5 = re.sub('e', '𝒆', zhrf5)
    zhrf5 = re.sub('E', '𝒆', zhrf5)
    zhrf5 = re.sub('r', '𝒓', zhrf5)
    zhrf5 = re.sub('R', '𝒓', zhrf5)
    zhrf5 = re.sub('t', '𝒕', zhrf5)
    zhrf5 = re.sub('T', '𝒕', zhrf5)
    zhrf5 = re.sub('y', '𝒚', zhrf5)
    zhrf5 = re.sub('Y', '𝒚', zhrf5)
    zhrf5 = re.sub('u', '𝒖', zhrf5)
    zhrf5 = re.sub('U', '𝒖', zhrf5)
    zhrf5 = re.sub('i', '𝒊', zhrf5)
    zhrf5 = re.sub('I', '𝒊', zhrf5)
    zhrf5 = re.sub('o', '𝒐', zhrf5)
    zhrf5 = re.sub('O', '𝒐', zhrf5)
    zhrf5 = re.sub('p', '𝒑', zhrf5)
    zhrf5 = re.sub('P', '𝒑', zhrf5)
    zhrf5 = re.sub('a', '𝒂', zhrf5)
    zhrf5 = re.sub('A', '𝒂', zhrf5)
    zhrf5 = re.sub('s', '𝒔', zhrf5)
    zhrf5 = re.sub('S', '𝒔', zhrf5)
    zhrf5 = re.sub('d', '𝒅', zhrf5)
    zhrf5 = re.sub('D', '𝒅', zhrf5)
    zhrf5 = re.sub('f', '𝒇', zhrf5)
    zhrf5 = re.sub('F', '𝒇', zhrf5)
    zhrf5 = re.sub('g', '𝒈', zhrf5)
    zhrf5 = re.sub('G', '𝒈', zhrf5)
    zhrf5 = re.sub('h', '𝒉', zhrf5)
    zhrf5 = re.sub('H', '𝒉', zhrf5)
    zhrf5 = re.sub('j', '𝒋', zhrf5)
    zhrf5 = re.sub('J', '𝒋', zhrf5)
    zhrf5 = re.sub('K', '𝒌', zhrf5)
    zhrf5 = re.sub('k', '??', zhrf5)
    zhrf5 = re.sub('L', '𝒍', zhrf5)
    zhrf5 = re.sub('l', '??', zhrf5)
    zhrf5 = re.sub('z', '𝒛', zhrf5)
    zhrf5 = re.sub('Z', '??', zhrf5)
    zhrf5 = re.sub('x', '𝒙', zhrf5)
    zhrf5 = re.sub('X', '𝒙', zhrf5)
    zhrf5 = re.sub('c', '𝒄', zhrf5)
    zhrf5 = re.sub('C', '𝒄', zhrf5)
    zhrf5 = re.sub('v', '𝒗', zhrf5)
    zhrf5 = re.sub('V', '𝒗', zhrf5)
    zhrf5 = re.sub('b', '𝒃', zhrf5)
    zhrf5 = re.sub('B', '𝒃', zhrf5)
    zhrf5 = re.sub('n', '𝒏', zhrf5)
    zhrf5 = re.sub('N', '𝒏', zhrf5)
    zhrf5 = re.sub('m', '𝒎', zhrf5)
    zhrf5 = re.sub('M', '𝒎', zhrf5)
    zhrf6 = re.sub('ض', 'ﺿ̭͠', text)
    zhrf6 = re.sub('ص', 'ﺻ͡', zhrf6)
    zhrf6 = re.sub('ث', 'ﺜ̲', zhrf6)
    zhrf6 = re.sub('ق', 'ﭰ', zhrf6)
    zhrf6 = re.sub('ف', 'ﻓ̲', zhrf6)
    zhrf6 = re.sub('غ', 'ﻏ̲', zhrf6)
    zhrf6 = re.sub('ع', 'ﻌ̲', zhrf6)
    zhrf6 = re.sub('ه', 'ﮬ̲̌', zhrf6)
    zhrf6 = re.sub('خ', 'خٌ', zhrf6)
    zhrf6 = re.sub('ح', 'ﺣ̅', zhrf6)
    zhrf6 = re.sub('ج', 'جُ', zhrf6)
    zhrf6 = re.sub('د', 'ډ̝', zhrf6)
    zhrf6 = re.sub('ذ', 'ذً', zhrf6)
    zhrf6 = re.sub('ش', 'ﺷ̲', zhrf6)
    zhrf6 = re.sub('س', 'ﺳ̉', zhrf6)
    zhrf6 = re.sub('ي', 'ﯾ̃̐', zhrf6)
    zhrf6 = re.sub('ب', 'ﺑ̲', zhrf6)
    zhrf6 = re.sub('ل', 'ا̄ﻟ', zhrf6)
    zhrf6 = re.sub('ا', 'ﺈ̃', zhrf6)
    zhrf6 = re.sub('ت', 'ټُ', zhrf6)
    zhrf6 = re.sub('ن', 'ﻧ̲', zhrf6)
    zhrf6 = re.sub('م', 'ﻣ̲̉', zhrf6)
    zhrf6 = re.sub('ك', 'گ', zhrf6)
    zhrf6 = re.sub('ط', 'ﻁ̲', zhrf6)
    zhrf6 = re.sub('ئ', ' ْٰئ', zhrf6)
    zhrf6 = re.sub('ء', 'ء', zhrf6)
    zhrf6 = re.sub('ؤ', 'ؤ', zhrf6)
    zhrf6 = re.sub('ر', 'ہڕ', zhrf6)
    zhrf6 = re.sub('لا', 'ﻟ̲ﺂ̲', zhrf6)
    zhrf6 = re.sub('ى', 'ى', zhrf6)
    zhrf6 = re.sub('ة', 'ة', zhrf6)
    zhrf6 = re.sub('و', 'ۇۈۉ', zhrf6)
    zhrf6 = re.sub('ز', 'زُ', zhrf6)
    zhrf6 = re.sub('ظ', 'ﻇ̲', zhrf6)
    zhrf6 = re.sub('q', 'ǫ', zhrf6)
    zhrf6 = re.sub('Q', 'ǫ', zhrf6)
    zhrf6 = re.sub('w', 'ᴡ', zhrf6)
    zhrf6 = re.sub('W', 'ᴡ', zhrf6)
    zhrf6 = re.sub('e', 'ᴇ', zhrf6)
    zhrf6 = re.sub('E', 'ᴇ', zhrf6)
    zhrf6 = re.sub('r', 'ʀ', zhrf6)
    zhrf6 = re.sub('R', 'ʀ', zhrf6)
    zhrf6 = re.sub('t', 'ᴛ', zhrf6)
    zhrf6 = re.sub('T', 'ᴛ', zhrf6)
    zhrf6 = re.sub('y', 'ʏ', zhrf6)
    zhrf6 = re.sub('Y', 'ʏ', zhrf6)
    zhrf6 = re.sub('u', 'ụ', zhrf6)
    zhrf6 = re.sub('U', 'ụ', zhrf6)
    zhrf6 = re.sub('i', 'ɪ', zhrf6)
    zhrf6 = re.sub('I', 'ɪ', zhrf6)
    zhrf6 = re.sub('o', 'ᴏ', zhrf6)
    zhrf6 = re.sub('O', 'ᴏ', zhrf6)
    zhrf6 = re.sub('p', 'ᴘ', zhrf6)
    zhrf6 = re.sub('P', 'ᴘ', zhrf6)
    zhrf6 = re.sub('a', 'ᴀ', zhrf6)
    zhrf6 = re.sub('A', 'ᴀ', zhrf6)
    zhrf6 = re.sub('s', 'ѕ', zhrf6)
    zhrf6 = re.sub('S', 'ѕ', zhrf6)
    zhrf6 = re.sub('d', 'ᴅ', zhrf6)
    zhrf6 = re.sub('D', 'ᴅ', zhrf6)
    zhrf6 = re.sub('f', 'ғ', zhrf6)
    zhrf6 = re.sub('F', 'ғ', zhrf6)
    zhrf6 = re.sub('g', 'ɢ', zhrf6)
    zhrf6 = re.sub('G', 'ɢ', zhrf6)
    zhrf6 = re.sub('h', 'ʜ', zhrf6)
    zhrf6 = re.sub('H', 'ʜ', zhrf6)
    zhrf6 = re.sub('j', 'ᴊ', zhrf6)
    zhrf6 = re.sub('J', 'ᴊ', zhrf6)
    zhrf6 = re.sub('K', 'ᴋ', zhrf6)
    zhrf6 = re.sub('k', 'ᴋ', zhrf6)
    zhrf6 = re.sub('L', 'ʟ', zhrf6)
    zhrf6 = re.sub('l', 'ʟ', zhrf6)
    zhrf6 = re.sub('z', 'ᴢ', zhrf6)
    zhrf6 = re.sub('Z', 'ᴢ', zhrf6)
    zhrf6 = re.sub('x', 'х', zhrf6)
    zhrf6 = re.sub('X', 'х', zhrf6)
    zhrf6 = re.sub('c', 'ᴄ', zhrf6)
    zhrf6 = re.sub('C', 'ᴄ', zhrf6)
    zhrf6 = re.sub('v', 'ᴠ', zhrf6)
    zhrf6 = re.sub('V', 'ᴠ', zhrf6)
    zhrf6 = re.sub('b', 'ʙ', zhrf6)
    zhrf6 = re.sub('B', 'ʙ', zhrf6)
    zhrf6 = re.sub('n', 'ɴ', zhrf6)
    zhrf6 = re.sub('N', 'ɴ', zhrf6)
    zhrf6 = re.sub('m', 'ᴍ', zhrf6)
    zhrf6 = re.sub('M', 'ᴍ', zhrf6)

    zhrf7 = re.sub('ض', 'ﺿ', text)
    zhrf7 = re.sub('ص', 'ﺻ', zhrf7)
    zhrf7 = re.sub('ث', 'ﭥ', zhrf7)
    zhrf7 = re.sub('ق', 'ﻗ̮ـ̃', zhrf7)
    zhrf7 = re.sub('ف', 'ﭬ', zhrf7)
    zhrf7 = re.sub('غ', 'ﻏ̣̐', zhrf7)
    zhrf7 = re.sub('ع', 'ﻋ', zhrf7)
    zhrf7 = re.sub('ه', 'ھَہّ', zhrf7)
    zhrf7 = re.sub('خ', 'ﺧ', zhrf7)
    zhrf7 = re.sub('ح', 'פ', zhrf7)
    zhrf7 = re.sub('ج', 'ﭴ', zhrf7)
    zhrf7 = re.sub('د', 'ﮃ', zhrf7)
    zhrf7 = re.sub('ذ', 'ذ', zhrf7)
    zhrf7 = re.sub('ش', 'ﺷ', zhrf7)
    zhrf7 = re.sub('س', 'ﺳ', zhrf7)
    zhrf7 = re.sub('ي', 'ﯾ', zhrf7)
    zhrf7 = re.sub('ب', 'ﺑ', zhrf7)
    zhrf7 = re.sub('ل', 'ﻟ', zhrf7)
    zhrf7 = re.sub('ا', 'ﺂ', zhrf7)
    zhrf7 = re.sub('ت', 'ﭠ', zhrf7)
    zhrf7 = re.sub('ن', 'ﻧ', zhrf7)
    zhrf7 = re.sub('م', 'ﻣ̝̚', zhrf7)
    zhrf7 = re.sub('ك', 'گـ', zhrf7)
    zhrf7 = re.sub('ط', 'ﻁْ', zhrf7)
    zhrf7 = re.sub('ئ', 'ٰئـ', zhrf7)
    zhrf7 = re.sub('ء', 'ء', zhrf7)
    zhrf7 = re.sub('ؤ', 'ﯗ', zhrf7)
    zhrf7 = re.sub('ر', 'ړُ', zhrf7)
    zhrf7 = re.sub('لا', 'ﻟآ', zhrf7)
    zhrf7 = re.sub('ى', 'ـﮯ', zhrf7)
    zhrf7 = re.sub('ة', 'ة', zhrf7)
    zhrf7 = re.sub('و', 'ۆ', zhrf7)
    zhrf7 = re.sub('ز', 'ژ', zhrf7)
    zhrf7 = re.sub('ظ', 'ﻅ', zhrf7)
    zhrf7 = re.sub('q', '??', zhrf7)
    zhrf7 = re.sub('Q', '𝘘', zhrf7)
    zhrf7 = re.sub('w', '𝘞', zhrf7)
    zhrf7 = re.sub('W', '𝘞', zhrf7)
    zhrf7 = re.sub('e', '𝘌', zhrf7)
    zhrf7 = re.sub('E', '𝘌', zhrf7)
    zhrf7 = re.sub('r', '𝘙', zhrf7)
    zhrf7 = re.sub('R', '𝘙', zhrf7)
    zhrf7 = re.sub('t', '𝘛', zhrf7)
    zhrf7 = re.sub('T', '𝘛', zhrf7)
    zhrf7 = re.sub('y', '𝘠', zhrf7)
    zhrf7 = re.sub('Y', '𝘠', zhrf7)
    zhrf7 = re.sub('u', '𝘜', zhrf7)
    zhrf7 = re.sub('U', '𝘜', zhrf7)
    zhrf7 = re.sub('i', '𝘐', zhrf7)
    zhrf7 = re.sub('I', '𝘐', zhrf7)
    zhrf7 = re.sub('o', '𝘖', zhrf7)
    zhrf7 = re.sub('O', '𝘖', zhrf7)
    zhrf7 = re.sub('p', '𝘗', zhrf7)
    zhrf7 = re.sub('P', '𝘗', zhrf7)
    zhrf7 = re.sub('a', '𝘈', zhrf7)
    zhrf7 = re.sub('A', '𝘈', zhrf7)
    zhrf7 = re.sub('s', '𝘚', zhrf7)
    zhrf7 = re.sub('S', '𝘚', zhrf7)
    zhrf7 = re.sub('d', '𝘋', zhrf7)
    zhrf7 = re.sub('D', '𝘋', zhrf7)
    zhrf7 = re.sub('f', '𝘍', zhrf7)
    zhrf7 = re.sub('F', '𝘍', zhrf7)
    zhrf7 = re.sub('g', '𝘎', zhrf7)
    zhrf7 = re.sub('G', '𝘎', zhrf7)
    zhrf7 = re.sub('h', '𝘏', zhrf7)
    zhrf7 = re.sub('H', '𝘏', zhrf7)
    zhrf7 = re.sub('j', '??', zhrf7)
    zhrf7 = re.sub('J', '𝘑', zhrf7)
    zhrf7 = re.sub('k', '𝘒', zhrf7)
    zhrf7 = re.sub('K', '𝘒', zhrf7)
    zhrf7 = re.sub('L', '𝘓', zhrf7)
    zhrf7 = re.sub('l', '𝘓', zhrf7)
    zhrf7 = re.sub('z', '𝘡', zhrf7)
    zhrf7 = re.sub('Z', '𝘡', zhrf7)
    zhrf7 = re.sub('x', '𝘟', zhrf7)
    zhrf7 = re.sub('X', '𝘟', zhrf7)
    zhrf7 = re.sub('c', '𝘊', zhrf7)
    zhrf7 = re.sub('C', '𝘊', zhrf7)
    zhrf7 = re.sub('v', '𝘝', zhrf7)
    zhrf7 = re.sub('V', '𝘝', zhrf7)
    zhrf7 = re.sub('b', '𝘉', zhrf7)
    zhrf7 = re.sub('B', '𝘉', zhrf7)
    zhrf7 = re.sub('n', '𝘕', zhrf7)
    zhrf7 = re.sub('N', '𝘕', zhrf7)
    zhrf7 = re.sub('m', '𝘔', zhrf7)
    zhrf7 = re.sub('M', '𝘔', zhrf7)

    zhrf8 = re.sub('ض', 'ض', text)
    zhrf8 = re.sub('ص', 'صہٰ', zhrf8)
    zhrf8 = re.sub('ث', 'ثہٰـ', zhrf8)
    zhrf8 = re.sub('ق', 'قہٰ', zhrf8)
    zhrf8 = re.sub('ف', 'فہٰ', zhrf8)
    zhrf8 = re.sub('غ', 'غـْ', zhrf8)
    zhrf8 = re.sub('ع', 'ع', zhrf8)
    zhrf8 = re.sub('ه', 'هٰہٰٖ', zhrf8)
    zhrf8 = re.sub('خ', 'خخَـ', zhrf8)
    zhrf8 = re.sub('ح', 'حہٰ', zhrf8)
    zhrf8 = re.sub('ج', 'ججہٰ', zhrf8)
    zhrf8 = re.sub('د', 'دَ', zhrf8)
    zhrf8 = re.sub('ذ', 'ذّ', zhrf8)
    zhrf8 = re.sub('ش', 'ششہٰ', zhrf8)
    zhrf8 = re.sub('س', 'سہٰ', zhrf8)
    zhrf8 = re.sub('ي', 'يٰ', zhrf8)
    zhrf8 = re.sub('ب', 'بٰٰ', zhrf8)
    zhrf8 = re.sub('ل', 'لہٰ', zhrf8)
    zhrf8 = re.sub('ا', 'آ', zhrf8)
    zhrf8 = re.sub('ت', 'تہٰ', zhrf8)
    zhrf8 = re.sub('ن', 'نہٰ', zhrf8)
    zhrf8 = re.sub('م', 'مہٰ', zhrf8)
    zhrf8 = re.sub('ك', 'ككہٰ', zhrf8)
    zhrf8 = re.sub('ط', 'طہٰ', zhrf8)
    zhrf8 = re.sub('ئ', ' ْئٰ', zhrf8)
    zhrf8 = re.sub('ء', 'ء', zhrf8)
    zhrf8 = re.sub('ؤ', 'ؤؤَ', zhrf8)
    zhrf8 = re.sub('ر', 'رَ', zhrf8)
    zhrf8 = re.sub('لا', 'لہٰا', zhrf8)
    zhrf8 = re.sub('ى', 'ىہٰ', zhrf8)
    zhrf8 = re.sub('ة', 'ة', zhrf8)
    zhrf8 = re.sub('و', 'ہٰو', zhrf8)
    zhrf8 = re.sub('ز', 'ز', zhrf8)
    zhrf8 = re.sub('ظ', 'ظہٰ', zhrf8)
    zhrf8 = re.sub('q', '𝚀', zhrf8)
    zhrf8 = re.sub('Q', '𝚀', zhrf8)
    zhrf8 = re.sub('w', '𝚆', zhrf8)
    zhrf8 = re.sub('W', '𝚆', zhrf8)
    zhrf8 = re.sub('e', '𝙴', zhrf8)
    zhrf8 = re.sub('E', '𝙴', zhrf8)
    zhrf8 = re.sub('r', '𝚁', zhrf8)
    zhrf8 = re.sub('R', '𝚁', zhrf8)
    zhrf8 = re.sub('t', '𝚃', zhrf8)
    zhrf8 = re.sub('T', '𝚃', zhrf8)
    zhrf8 = re.sub('y', '𝚈', zhrf8)
    zhrf8 = re.sub('Y', '𝚈', zhrf8)
    zhrf8 = re.sub('u', '𝚄', zhrf8)
    zhrf8 = re.sub('U', '𝚄', zhrf8)
    zhrf8 = re.sub('i', '𝙸', zhrf8)
    zhrf8 = re.sub('I', '𝙸', zhrf8)
    zhrf8 = re.sub('o', '𝙾', zhrf8)
    zhrf8 = re.sub('O', '𝙾', zhrf8)
    zhrf8 = re.sub('p', '𝙿', zhrf8)
    zhrf8 = re.sub('P', '𝙿', zhrf8)
    zhrf8 = re.sub('a', '𝙰', zhrf8)
    zhrf8 = re.sub('A', '𝙰', zhrf8)
    zhrf8 = re.sub('s', '𝚂', zhrf8)
    zhrf8 = re.sub('S', '𝚂', zhrf8)
    zhrf8 = re.sub('d', '𝙳', zhrf8)
    zhrf8 = re.sub('D', '𝙳', zhrf8)
    zhrf8 = re.sub('f', '𝙵', zhrf8)
    zhrf8 = re.sub('F', '𝙵', zhrf8)
    zhrf8 = re.sub('g', '𝙶', zhrf8)
    zhrf8 = re.sub('G', '𝙶', zhrf8)
    zhrf8 = re.sub('h', '𝙷', zhrf8)
    zhrf8 = re.sub('H', '𝙷', zhrf8)
    zhrf8 = re.sub('j', '𝙹', zhrf8)
    zhrf8 = re.sub('J', '𝙹', zhrf8)
    zhrf8 = re.sub('k', '𝙺', zhrf8)
    zhrf8 = re.sub('K', '𝙺', zhrf8)
    zhrf8 = re.sub('L', '𝙻', zhrf8)
    zhrf8 = re.sub('l', '𝙻', zhrf8)
    zhrf8 = re.sub('z', '𝚉', zhrf8)
    zhrf8 = re.sub('Z', '𝚉', zhrf8)
    zhrf8 = re.sub('x', '??', zhrf8)
    zhrf8 = re.sub('X', '𝚇', zhrf8)
    zhrf8 = re.sub('c', '𝙲', zhrf8)
    zhrf8 = re.sub('C', '𝙲', zhrf8)
    zhrf8 = re.sub('v', '𝚅', zhrf8)
    zhrf8 = re.sub('V', '𝚅', zhrf8)
    zhrf8 = re.sub('b', '𝙱', zhrf8)
    zhrf8 = re.sub('B', '𝙱', zhrf8)
    zhrf8 = re.sub('n', '𝙽', zhrf8)
    zhrf8 = re.sub('N', '𝙽', zhrf8)
    zhrf8 = re.sub('m', '𝙼', zhrf8)
    zhrf8 = re.sub('M', '𝙼', zhrf8)

    zhrf9 = re.sub('ض', 'ض', text)
    zhrf9 = re.sub('ص', 'ص', zhrf9)
    zhrf9 = re.sub('ث', 'ث', zhrf9)
    zhrf9 = re.sub('ق', 'قٌ', zhrf9)
    zhrf9 = re.sub('ف', 'فُ', zhrf9)
    zhrf9 = re.sub('غ', 'غ', zhrf9)
    zhrf9 = re.sub('ع', 'عٍ', zhrf9)
    zhrf9 = re.sub('ه', 'هـ', zhrf9)
    zhrf9 = re.sub('خ', 'خـ', zhrf9)
    zhrf9 = re.sub('ح', 'حٍ', zhrf9)
    zhrf9 = re.sub('ج', 'جٍ', zhrf9)
    zhrf9 = re.sub('د', 'دِ', zhrf9)
    zhrf9 = re.sub('ذ', 'ذَ', zhrf9)
    zhrf9 = re.sub('ش', 'شُ', zhrf9)
    zhrf9 = re.sub('س', 'س', zhrf9)
    zhrf9 = re.sub('ي', 'ي', zhrf9)
    zhrf9 = re.sub('ب', 'بَ', zhrf9)
    zhrf9 = re.sub('ل', 'لُِ', zhrf9)
    zhrf9 = re.sub('ا', 'آ', zhrf9)
    zhrf9 = re.sub('ت', 'ت', zhrf9)
    zhrf9 = re.sub('ن', 'ن', zhrf9)
    zhrf9 = re.sub('م', 'م', zhrf9)
    zhrf9 = re.sub('ك', 'ڪ', zhrf9)
    zhrf9 = re.sub('ط', 'طُ', zhrf9)
    zhrf9 = re.sub('ئ', 'ئ ْٰ', zhrf9)
    zhrf9 = re.sub('ء', 'ء', zhrf9)
    zhrf9 = re.sub('ؤ', 'ؤ', zhrf9)
    zhrf9 = re.sub('ر', 'ر', zhrf9)
    zhrf9 = re.sub('لا', 'لُِآ', zhrf9)
    zhrf9 = re.sub('ى', 'ىْ', zhrf9)
    zhrf9 = re.sub('ة', 'ة', zhrf9)
    zhrf9 = re.sub('و', 'وو', zhrf9)
    zhrf9 = re.sub('ز', 'ز', zhrf9)
    zhrf9 = re.sub('ظ', 'ظهُ', zhrf9)
    zhrf9 = re.sub('q', 'ℚ', zhrf9)
    zhrf9 = re.sub('Q', 'ℚ', zhrf9)
    zhrf9 = re.sub('w', '𝕎', zhrf9)
    zhrf9 = re.sub('W', '𝕎', zhrf9)
    zhrf9 = re.sub('e', '𝔼', zhrf9)
    zhrf9 = re.sub('E', '𝔼', zhrf9)
    zhrf9 = re.sub('r', 'ℝ', zhrf9)
    zhrf9 = re.sub('R', 'ℝ', zhrf9)
    zhrf9 = re.sub('t', '𝕋', zhrf9)
    zhrf9 = re.sub('T', '𝕋', zhrf9)
    zhrf9 = re.sub('y', '𝕐', zhrf9)
    zhrf9 = re.sub('Y', '𝕐', zhrf9)
    zhrf9 = re.sub('u', '𝕌', zhrf9)
    zhrf9 = re.sub('U', '𝕌', zhrf9)
    zhrf9 = re.sub('i', '𝕀', zhrf9)
    zhrf9 = re.sub('I', '𝕀', zhrf9)
    zhrf9 = re.sub('o', '𝕆', zhrf9)
    zhrf9 = re.sub('O', '𝕆', zhrf9)
    zhrf9 = re.sub('p', 'ℙ', zhrf9)
    zhrf9 = re.sub('P', 'ℙ', zhrf9)
    zhrf9 = re.sub('a', '𝔸', zhrf9)
    zhrf9 = re.sub('A', '𝔸', zhrf9)
    zhrf9 = re.sub('s', '𝕊', zhrf9)
    zhrf9 = re.sub('S', '𝕊', zhrf9)
    zhrf9 = re.sub('d', '𝔻', zhrf9)
    zhrf9 = re.sub('D', '𝔻', zhrf9)
    zhrf9 = re.sub('f', '𝔽', zhrf9)
    zhrf9 = re.sub('F', '𝔽', zhrf9)
    zhrf9 = re.sub('g', '𝔾', zhrf9)
    zhrf9 = re.sub('G', '𝔾', zhrf9)
    zhrf9 = re.sub('h', 'ℍ', zhrf9)
    zhrf9 = re.sub('H', 'ℍ', zhrf9)
    zhrf9 = re.sub('j', '𝕁', zhrf9)
    zhrf9 = re.sub('J', '𝕁', zhrf9)
    zhrf9 = re.sub('k', '𝕂', zhrf9)
    zhrf9 = re.sub('K', '𝕂', zhrf9)
    zhrf9 = re.sub('L', '𝕃', zhrf9)
    zhrf9 = re.sub('l', '𝕃', zhrf9)
    zhrf9 = re.sub('z', 'ℤ', zhrf9)
    zhrf9 = re.sub('Z', 'ℤ', zhrf9)
    zhrf9 = re.sub('x', '𝕏', zhrf9)
    zhrf9 = re.sub('X', '𝕏', zhrf9)
    zhrf9 = re.sub('c', 'ℂ', zhrf9)
    zhrf9 = re.sub('C', 'ℂ', zhrf9)
    zhrf9 = re.sub('v', '𝕍', zhrf9)
    zhrf9 = re.sub('V', '𝕍', zhrf9)
    zhrf9 = re.sub('b', '𝔹', zhrf9)
    zhrf9 = re.sub('B', '𝔹', zhrf9)
    zhrf9 = re.sub('n', 'ℕ', zhrf9)
    zhrf9 = re.sub('N', 'ℕ', zhrf9)
    zhrf9 = re.sub('m', '𝕄', zhrf9)
    zhrf9 = re.sub('M', '𝕄', zhrf9)
    
    zhrf10 = re.sub('ض', 'ضۜہٰٰ', text)
    zhrf10 = re.sub('ص', 'ضۜہٰٰ', zhrf10)
    zhrf10 = re.sub('ث', 'ثہٰٰ', zhrf10)
    zhrf10 = re.sub('ق', 'قྀ̲ہٰٰ', zhrf10)
    zhrf10 = re.sub('ف', 'ف͒ہٰٰ', zhrf10)
    zhrf10 = re.sub('غ', 'غہٰٰ', zhrf10)
    zhrf10 = re.sub('ع', 'عہٰٰ', zhrf10)
    zhrf10 = re.sub('ه', 'هٰہٰٖ', zhrf10)
    zhrf10 = re.sub('خ', 'خٰ̐ہ', zhrf10)
    zhrf10 = re.sub('ح', 'حہٰٰ', zhrf10)
    zhrf10 = re.sub('ج', 'جـٰ̲ـہْۧ', zhrf10)
    zhrf10 = re.sub('د', 'دٰ', zhrf10)
    zhrf10 = re.sub('ذ', 'ذِٰ', zhrf10)
    zhrf10 = re.sub('ش', 'شِٰہٰٰ', zhrf10)
    zhrf10 = re.sub('س', 'سٰٓ', zhrf10)
    zhrf10 = re.sub('ي', 'يِٰہ', zhrf10)
    zhrf10 = re.sub('ب', 'بّہ', zhrf10)
    zhrf10 = re.sub('ل', 'لـٰ̲ـہ', zhrf10)
    zhrf10 = re.sub('ا', 'آ', zhrf10)
    zhrf10 = re.sub('ت', 'تَہَ', zhrf10)
    zhrf10 = re.sub('ن', 'نَِہ', zhrf10)
    zhrf10 = re.sub('م', 'مٰ̲ہ', zhrf10)
    zhrf10 = re.sub('ك', 'ڪٰྀہٰٰ', zhrf10)
    zhrf10 = re.sub('ط', 'طۨہٰٰ', zhrf10)
    zhrf10 = re.sub('ئ', 'ئ ْ', zhrf10)
    zhrf10 = re.sub('ء', 'ء', zhrf10)
    zhrf10 = re.sub('ؤ', 'ؤ', zhrf10)
    zhrf10 = re.sub('ر', 'رَ', zhrf10)
    zhrf10 = re.sub('لا', 'لـٰ̲ـہآ', zhrf10)
    zhrf10 = re.sub('ى', 'ىْ', zhrf10)
    zhrf10 = re.sub('ة', 'ة', zhrf10)
    zhrf10 = re.sub('و', 'وِٰ', zhrf10)
    zhrf10 = re.sub('ز', 'زَٰ', zhrf10)
    zhrf10 = re.sub('ظ', 'ظۗہٰٰ', zhrf10)
    zhrf10 = re.sub('a', "Ⓐ", zhrf10)
    zhrf10 = re.sub('A', "Ⓐ", zhrf10)
    zhrf10 = re.sub("b", "Ⓑ", zhrf10)
    zhrf10 = re.sub("B", "Ⓑ", zhrf10)
    zhrf10 = re.sub("c", "Ⓒ", zhrf10)
    zhrf10 = re.sub("C", "Ⓒ", zhrf10)
    zhrf10 = re.sub("d", "Ⓓ", zhrf10)
    zhrf10 = re.sub("D", "Ⓓ", zhrf10)
    zhrf10 = re.sub("e", "Ⓔ", zhrf10)
    zhrf10 = re.sub("E", "Ⓔ", zhrf10)
    zhrf10 = re.sub("f", "Ⓕ", zhrf10)
    zhrf10 = re.sub("F", "Ⓕ", zhrf10)
    zhrf10 = re.sub("g", "Ⓖ", zhrf10)
    zhrf10 = re.sub("G", "Ⓖ", zhrf10)
    zhrf10 = re.sub("h", "Ⓗ", zhrf10)
    zhrf10 = re.sub("H", "Ⓗ", zhrf10)
    zhrf10 = re.sub("i", "Ⓘ", zhrf10)
    zhrf10 = re.sub("I", "Ⓘ", zhrf10)
    zhrf10 = re.sub("j", "Ⓙ", zhrf10)
    zhrf10 = re.sub("J", "Ⓙ", zhrf10)
    zhrf10 = re.sub("k", "Ⓚ", zhrf10)
    zhrf10 = re.sub("K", "Ⓚ", zhrf10)
    zhrf10 = re.sub("l", "Ⓛ", zhrf10)
    zhrf10 = re.sub("L", "Ⓛ", zhrf10)
    zhrf10 = re.sub("m", "Ⓜ", zhrf10)
    zhrf10 = re.sub("M", "Ⓜ", zhrf10)
    zhrf10 = re.sub("n", "Ⓝ", zhrf10)
    zhrf10 = re.sub("N", "Ⓝ", zhrf10)
    zhrf10 = re.sub("o", "Ⓞ", zhrf10)
    zhrf10 = re.sub("O", "Ⓞ", zhrf10)
    zhrf10 = re.sub("p", "Ⓟ", zhrf10)
    zhrf10 = re.sub("P", "Ⓟ", zhrf10)
    zhrf10 = re.sub("q", "Ⓠ", zhrf10)
    zhrf10 = re.sub("Q", "Ⓠ", zhrf10)
    zhrf10 = re.sub("r", "Ⓡ", zhrf10)
    zhrf10 = re.sub("R", "Ⓡ", zhrf10)
    zhrf10 = re.sub("s", "Ⓢ", zhrf10)
    zhrf10 = re.sub("S", "Ⓢ", zhrf10)
    zhrf10 = re.sub("t", "Ⓣ", zhrf10)
    zhrf10 = re.sub("T", "Ⓣ", zhrf10)
    zhrf10 = re.sub("u", "Ⓤ", zhrf10)
    zhrf10 = re.sub("U", "Ⓤ", zhrf10)
    zhrf10 = re.sub("v", "Ⓥ", zhrf10)
    zhrf10 = re.sub("V", "Ⓥ", zhrf10)
    zhrf10 = re.sub("w", "Ⓦ", zhrf10)
    zhrf10 = re.sub("W", "Ⓦ", zhrf10)
    zhrf10 = re.sub("x", "Ⓧ", zhrf10)
    zhrf10 = re.sub("X", "Ⓧ", zhrf10)
    zhrf10 = re.sub("y", "Ⓨ", zhrf10)
    zhrf10 = re.sub("Y", "Ⓨ", zhrf10)
    zhrf10 = re.sub("z", "Ⓩ", zhrf10)
    zhrf10 = re.sub("Z", "Ⓩ", zhrf10)
    
    zhrf11 = re.sub('ض', 'ضـ🌙ـ', text)
    zhrf11 = re.sub('ص', 'صـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ث', 'ثـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ق', 'قـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ف', 'فـ🌙ـ', zhrf11)
    zhrf11 = re.sub('غ', 'غـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ع', 'عـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ه', 'هّ', zhrf11)
    zhrf11 = re.sub('خ', 'خـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ح', 'حـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ج', 'جـ🌙ـ', zhrf11)
    zhrf11 = re.sub('د', 'د', zhrf11)
    zhrf11 = re.sub('ذ', 'ذ', zhrf11)
    zhrf11 = re.sub('ش', 'شـ🌙ـ', zhrf11)
    zhrf11 = re.sub('س', 'سـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ي', 'يـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ب', 'بـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ل', 'لَ', zhrf11)
    zhrf11 = re.sub('ا', 'آ', zhrf11)
    zhrf11 = re.sub('ت', 'تـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ن', 'نـ🌙ـ', zhrf11)
    zhrf11 = re.sub('م', 'مـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ك', 'كـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ط', 'طـ🌙ـ', zhrf11)
    zhrf11 = re.sub('ئ', 'ئ', zhrf11)
    zhrf11 = re.sub('ء', 'ء', zhrf11)
    zhrf11 = re.sub('ؤ', 'ؤ', zhrf11)
    zhrf11 = re.sub('ر', 'ر', zhrf11)
    zhrf11 = re.sub('لا', 'لَآ', zhrf11)
    zhrf11 = re.sub('ى', 'ى', zhrf11)
    zhrf11 = re.sub('ة', 'ةّ', zhrf11)
    zhrf11 = re.sub('و', 'وٌ', zhrf11)
    zhrf11 = re.sub('ز', 'زِّ', zhrf11)
    zhrf11 = re.sub('ظ', 'ظـ🌙ـ', zhrf11)
    zhrf11 = re.sub('a', "‌🇦", zhrf11)
    zhrf11 = re.sub('A', "‌🇦", zhrf11)
    zhrf11 = re.sub("b", "‌🇧", zhrf11)
    zhrf11 = re.sub("B", "‌🇧", zhrf11)
    zhrf11 = re.sub("c", "‌🇨", zhrf11)
    zhrf11 = re.sub("C", "‌🇨", zhrf11)
    zhrf11 = re.sub("d", "‌🇩", zhrf11)
    zhrf11 = re.sub("D", "‌🇩", zhrf11)
    zhrf11 = re.sub("e", "‌🇪", zhrf11)
    zhrf11 = re.sub("E", "‌🇪", zhrf11)
    zhrf11 = re.sub("f", "‌🇫", zhrf11)
    zhrf11 = re.sub("F", "‌🇫", zhrf11)
    zhrf11 = re.sub("g", "‌??", zhrf11)
    zhrf11 = re.sub("G", "‌🇬", zhrf11)
    zhrf11 = re.sub("h", "‌🇭", zhrf11)
    zhrf11 = re.sub("H", "‌🇭", zhrf11)
    zhrf11 = re.sub("i", "‌🇮", zhrf11)
    zhrf11 = re.sub("I", "‌🇮", zhrf11)
    zhrf11 = re.sub("j", "‌🇯", zhrf11)
    zhrf11 = re.sub("J", "‌🇯", zhrf11)
    zhrf11 = re.sub("k", "‌🇰", zhrf11)
    zhrf11 = re.sub("K", "‌🇰", zhrf11)
    zhrf11 = re.sub("l", "‌🇱", zhrf11)
    zhrf11 = re.sub("L", "‌🇱", zhrf11)
    zhrf11 = re.sub("m", "‌🇲", zhrf11)
    zhrf11 = re.sub("M", "‌🇲", zhrf11)
    zhrf11 = re.sub("n", "‌🇳", zhrf11)
    zhrf11 = re.sub("N", "‌🇳", zhrf11)
    zhrf11 = re.sub("o", "‌🇴", zhrf11)
    zhrf11 = re.sub("O", "‌🇴", zhrf11)
    zhrf11 = re.sub("p", "‌🇵", zhrf11)
    zhrf11 = re.sub("P", "‌🇵", zhrf11)
    zhrf11 = re.sub("q", "‌🇶", zhrf11)
    zhrf11 = re.sub("Q", "‌🇶", zhrf11)
    zhrf11 = re.sub("r", "‌🇷", zhrf11)
    zhrf11 = re.sub("R", "‌🇷", zhrf11)
    zhrf11 = re.sub("s", "‌🇸", zhrf11)
    zhrf11 = re.sub("S", "‌🇸", zhrf11)
    zhrf11 = re.sub("t", "‌🇹", zhrf11)
    zhrf11 = re.sub("T", "‌🇹", zhrf11)
    zhrf11 = re.sub("u", "‌🇺", zhrf11)
    zhrf11 = re.sub("U", "‌🇺", zhrf11)
    zhrf11 = re.sub("v", "‌🇻", zhrf11)
    zhrf11 = re.sub("V", "‌🇻", zhrf11)
    zhrf11 = re.sub("w", "‌??", zhrf11)
    zhrf11 = re.sub("W", "‌🇼", zhrf11)
    zhrf11 = re.sub("x", "‌🇽", zhrf11)
    zhrf11 = re.sub("X", "‌🇽", zhrf11)
    zhrf11 = re.sub("y", "‌🇾", zhrf11)
    zhrf11 = re.sub("Y", "‌🇾", zhrf11)
    zhrf11 = re.sub("z", "‌🇿", zhrf11)
    zhrf11 = re.sub("Z", "‌🇿", zhrf11)
    
    zhrf12 = re.sub('ض', 'ضـ❣ـہ', text)
    zhrf12 = re.sub('ص', 'صـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ث', 'ثـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ق', 'قـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ف', 'فـ❣ـہ', zhrf12)
    zhrf12 = re.sub('غ', 'غـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ع', 'عـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ه', 'هـ❣ـہ', zhrf12)
    zhrf12 = re.sub('خ', 'خـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ح', 'حـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ج', 'جـ❣ـہ', zhrf12)
    zhrf12 = re.sub('د', 'د', zhrf12)
    zhrf12 = re.sub('ذ', 'ذ', zhrf12)
    zhrf12 = re.sub('ش', 'شـ❣ـہ', zhrf12)
    zhrf12 = re.sub('س', 'سـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ي', 'ي', zhrf12)
    zhrf12 = re.sub('ب', 'بـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ل', 'ل', zhrf12)
    zhrf12 = re.sub('ا', 'آ', zhrf12)
    zhrf12 = re.sub('ت', 'تـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ن', 'نـ❣ـہ', zhrf12)
    zhrf12 = re.sub('م', 'مـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ك', 'كـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ط', 'طـ❣ـہ', zhrf12)
    zhrf12 = re.sub('ئ', 'ئ', zhrf12)
    zhrf12 = re.sub('ء', 'ء', zhrf12)
    zhrf12 = re.sub('ؤ', 'ؤ', zhrf12)
    zhrf12 = re.sub('ر', 'ر', zhrf12)
    zhrf12 = re.sub('لا', 'لآ', zhrf12)
    zhrf12 = re.sub('ى', 'ى', zhrf12)
    zhrf12 = re.sub('ة', 'ةّ', zhrf12)
    zhrf12 = re.sub('و', 'وُ', zhrf12)
    zhrf12 = re.sub('ز', 'ز', zhrf12)
    zhrf12 = re.sub('ظ', 'ظـ❣ـہ', zhrf12)
    zhrf12 = re.sub('a', "Ã", zhrf12)
    zhrf12 = re.sub('A', "Ã", zhrf12)
    zhrf12 = re.sub("b", "β", zhrf12)
    zhrf12 = re.sub("B", "β", zhrf12)
    zhrf12 = re.sub("c", "Č", zhrf12)
    zhrf12 = re.sub("C", "Č", zhrf12)
    zhrf12 = re.sub("d", "Ď", zhrf12)
    zhrf12 = re.sub("D", "Ď", zhrf12)
    zhrf12 = re.sub("e", "Ẹ", zhrf12)
    zhrf12 = re.sub("E", "Ẹ", zhrf12)
    zhrf12 = re.sub("f", "Ƒ", zhrf12)
    zhrf12 = re.sub("F", "Ƒ", zhrf12)
    zhrf12 = re.sub("g", "Ğ", zhrf12)
    zhrf12 = re.sub("G", "Ğ", zhrf12)
    zhrf12 = re.sub("h", "Ĥ", zhrf12)
    zhrf12 = re.sub("H", "Ĥ", zhrf12)
    zhrf12 = re.sub("i", "Į", zhrf12)
    zhrf12 = re.sub("I", "Į", zhrf12)
    zhrf12 = re.sub("j", "Ĵ", zhrf12)
    zhrf12 = re.sub("J", "Ĵ", zhrf12)
    zhrf12 = re.sub("k", "Ќ", zhrf12)
    zhrf12 = re.sub("K", "Ќ", zhrf12)
    zhrf12 = re.sub("l", "Ĺ", zhrf12)
    zhrf12 = re.sub("L", "Ĺ", zhrf12)
    zhrf12 = re.sub("m", "ϻ", zhrf12)
    zhrf12 = re.sub("M", "ϻ", zhrf12)
    zhrf12 = re.sub("n", "Ň", zhrf12)
    zhrf12 = re.sub("N", "Ň", zhrf12)
    zhrf12 = re.sub("o", "Ỗ", zhrf12)
    zhrf12 = re.sub("O", "Ỗ", zhrf12)
    zhrf12 = re.sub("p", "Ƥ", zhrf12)
    zhrf12 = re.sub("P", "Ƥ", zhrf12)
    zhrf12 = re.sub("q", "Q", zhrf12)
    zhrf12 = re.sub("Q", "Q", zhrf12)
    zhrf12 = re.sub("r", "Ř", zhrf12)
    zhrf12 = re.sub("R", "Ř", zhrf12)
    zhrf12 = re.sub("s", "Ŝ", zhrf12)
    zhrf12 = re.sub("S", "Ŝ", zhrf12)
    zhrf12 = re.sub("t", "Ť", zhrf12)
    zhrf12 = re.sub("T", "Ť", zhrf12)
    zhrf12 = re.sub("u", "Ǘ", zhrf12)
    zhrf12 = re.sub("U", "Ǘ", zhrf12)
    zhrf12 = re.sub("v", "ϋ", zhrf12)
    zhrf12 = re.sub("V", "ϋ", zhrf12)
    zhrf12 = re.sub("w", "Ŵ", zhrf12)
    zhrf12 = re.sub("W", "Ŵ", zhrf12)
    zhrf12 = re.sub("x", "Ж", zhrf12)
    zhrf12 = re.sub("X", "Ж", zhrf12)
    zhrf12 = re.sub("y", "Ў", zhrf12)
    zhrf12 = re.sub("Y", "Ў", zhrf12)
    zhrf12 = re.sub("z", "Ż", zhrf12)
    zhrf12 = re.sub("Z", "Ż", zhrf12)
    zhrf13 = re.sub('ض', 'ضـ❤ـ', text)
    zhrf13 = re.sub('ص', 'صـ❤ـ', zhrf13)
    zhrf13 = re.sub('ث', 'ثـ❤ـ', zhrf13)
    zhrf13 = re.sub('ق', 'قـ❤ـ', zhrf13)
    zhrf13 = re.sub('ف', 'فـ❤ـ', zhrf13)
    zhrf13 = re.sub('غ', 'غـ❤ـ', zhrf13)
    zhrf13 = re.sub('ع', 'عـ❤ـ', zhrf13)
    zhrf13 = re.sub('ه', 'هّ', zhrf13)
    zhrf13 = re.sub('خ', 'خـ❤ـ', zhrf13)
    zhrf13 = re.sub('ح', 'حـ❤ـ', zhrf13)
    zhrf13 = re.sub('ج', 'جـ❤ـ', zhrf13)
    zhrf13 = re.sub('د', 'د', zhrf13)
    zhrf13 = re.sub('ذ', 'ذ', zhrf13)
    zhrf13 = re.sub('ش', 'شـ❤ـ', zhrf13)
    zhrf13 = re.sub('س', 'سـ❤ـ', zhrf13)
    zhrf13 = re.sub('ي', 'يـ❤ـ', zhrf13)
    zhrf13 = re.sub('ب', 'بـ❤ـ', zhrf13)
    zhrf13 = re.sub('ل', 'لَ', zhrf13)
    zhrf13 = re.sub('ا', 'آ', zhrf13)
    zhrf13 = re.sub('ت', 'تـ❤ـ', zhrf13)
    zhrf13 = re.sub('ن', 'نـ❤ـ', zhrf13)
    zhrf13 = re.sub('م', 'مـ❤ـ', zhrf13)
    zhrf13 = re.sub('ك', 'كـ❤ـ', zhrf13)
    zhrf13 = re.sub('ط', 'طـ❤ـ', zhrf13)
    zhrf13 = re.sub('ئ', 'ئ', zhrf13)
    zhrf13 = re.sub('ء', 'ء', zhrf13)
    zhrf13 = re.sub('ؤ', 'ؤ', zhrf13)
    zhrf13 = re.sub('ر', 'ر', zhrf13)
    zhrf13 = re.sub('لا', 'لَآ', zhrf13)
    zhrf13 = re.sub('ى', 'ى', zhrf13)
    zhrf13 = re.sub('ة', 'ةّ', zhrf13)
    zhrf13 = re.sub('و', 'وٌ', zhrf13)
    zhrf13 = re.sub('ز', 'زِّ', zhrf13)
    zhrf13 = re.sub('ظ', 'ظـ❤ـ', zhrf13)
    zhrf13 = re.sub('a', "❤a", zhrf13)
    zhrf13 = re.sub('A', "❤A", zhrf13)
    zhrf13 = re.sub("b", "❤b", zhrf13)
    zhrf13 = re.sub("B", "❤B", zhrf13)
    zhrf13 = re.sub("c", "❤c", zhrf13)
    zhrf13 = re.sub("C", "❤C", zhrf13)
    zhrf13 = re.sub("d", "❤d", zhrf13)
    zhrf13 = re.sub("D", "❤D", zhrf13)
    zhrf13 = re.sub("e", "❤e", zhrf13)
    zhrf13 = re.sub("E", "❤E", zhrf13)
    zhrf13 = re.sub("f", "❤f", zhrf13)
    zhrf13 = re.sub("F", "❤F", zhrf13)
    zhrf13 = re.sub("g", "❤g", zhrf13)
    zhrf13 = re.sub("G", "❤G", zhrf13)
    zhrf13 = re.sub("h", "❤h", zhrf13)
    zhrf13 = re.sub("H", "❤H", zhrf13)
    zhrf13 = re.sub("i", "❤i", zhrf13)
    zhrf13 = re.sub("I", "❤I", zhrf13)
    zhrf13 = re.sub("j", "❤j", zhrf13)
    zhrf13 = re.sub("J", "❤J", zhrf13)
    zhrf13 = re.sub("k", "❤k", zhrf13)
    zhrf13 = re.sub("K", "❤K", zhrf13)
    zhrf13 = re.sub("l", "❤l", zhrf13)
    zhrf13 = re.sub("L", "❤L", zhrf13)
    zhrf13 = re.sub("m", "❤m", zhrf13)
    zhrf13 = re.sub("M", "❤M", zhrf13)
    zhrf13 = re.sub("n", "❤n", zhrf13)
    zhrf13 = re.sub("N", "❤N", zhrf13)
    zhrf13 = re.sub("o", "❤o", zhrf13)
    zhrf13 = re.sub("O", "❤O", zhrf13)
    zhrf13 = re.sub("p", "❤p", zhrf13)
    zhrf13 = re.sub("P", "❤P", zhrf13)
    zhrf13 = re.sub("q", "❤q", zhrf13)
    zhrf13 = re.sub("Q", "❤Q", zhrf13)
    zhrf13 = re.sub("r", "❤r", zhrf13)
    zhrf13 = re.sub("R", "❤R", zhrf13)
    zhrf13 = re.sub("s", "❤s", zhrf13)
    zhrf13 = re.sub("S", "❤S", zhrf13)
    zhrf13 = re.sub("t", "❤t", zhrf13)
    zhrf13 = re.sub("T", "❤T", zhrf13)
    zhrf13 = re.sub("u", "❤u", zhrf13)
    zhrf13 = re.sub("U", "❤U", zhrf13)
    zhrf13 = re.sub("v", "❤v", zhrf13)
    zhrf13 = re.sub("V", "❤V", zhrf13)
    zhrf13 = re.sub("w", "❤w", zhrf13)
    zhrf13 = re.sub("W", "❤W", zhrf13)
    zhrf13 = re.sub("x", "❤x", zhrf13)
    zhrf13 = re.sub("X", "❤X", zhrf13)
    zhrf13 = re.sub("y", "❤y", zhrf13)
    zhrf13 = re.sub("Y", "❤Y", zhrf13)
    zhrf13 = re.sub("z", "❤z", zhrf13)
    zhrf13 = re.sub("Z", "❤Z", zhrf13)

    zhrf14 = re.sub('ض', 'ضـ༈ۖ҉ـ', text)
    zhrf14 = re.sub('ص', 'صـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ث', 'ثـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ق', 'قـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ف', 'فـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('غ', 'غـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ع', 'عـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ه', 'هـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('خ', 'خـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ح', 'حـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ج', 'جـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('د', 'د', zhrf14)
    zhrf14 = re.sub('ذ', 'ذ', zhrf14)
    zhrf14 = re.sub('ش', 'شـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('س', 'سـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ي', 'يـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ب', 'بـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ل', 'لَ', zhrf14)
    zhrf14 = re.sub('ا', 'آ', zhrf14)
    zhrf14 = re.sub('ت', 'تـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ن', 'نـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('م', 'مـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ك', 'كـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('ط', 'ط', zhrf14)
    zhrf14 = re.sub('ئ', 'ئ', zhrf14)
    zhrf14 = re.sub('ء', 'ء', zhrf14)
    zhrf14 = re.sub('ؤ', 'ؤ', zhrf14)
    zhrf14 = re.sub('ر', 'ر', zhrf14)
    zhrf14 = re.sub('لا', 'لَآ', zhrf14)
    zhrf14 = re.sub('ى', 'ى', zhrf14)
    zhrf14 = re.sub('ة', 'ة', zhrf14)
    zhrf14 = re.sub('و', 'ؤُ', zhrf14)
    zhrf14 = re.sub('ز', 'ز', zhrf14)
    zhrf14 = re.sub('ظ', 'ظـ༈ۖ҉ـ', zhrf14)
    zhrf14 = re.sub('a', "α", zhrf14)
    zhrf14 = re.sub('A', "Α", zhrf14)
    zhrf14 = re.sub("b", "в", zhrf14)
    zhrf14 = re.sub("B", "В", zhrf14)
    zhrf14 = re.sub("c", "c", zhrf14)
    zhrf14 = re.sub("C", "C", zhrf14)
    zhrf14 = re.sub("d", "ɒ", zhrf14)
    zhrf14 = re.sub("D", "Ɒ", zhrf14)
    zhrf14 = re.sub("e", "є", zhrf14)
    zhrf14 = re.sub("E", "Є", zhrf14)
    zhrf14 = re.sub("f", "f", zhrf14)
    zhrf14 = re.sub("F", "F", zhrf14)
    zhrf14 = re.sub("g", "ɢ", zhrf14)
    zhrf14 = re.sub("G", "ɢ", zhrf14)
    zhrf14 = re.sub("h", "н", zhrf14)
    zhrf14 = re.sub("H", "Н", zhrf14)
    zhrf14 = re.sub("i", "i", zhrf14)
    zhrf14 = re.sub("I", "I", zhrf14)
    zhrf14 = re.sub("j", "j", zhrf14)
    zhrf14 = re.sub("J", "J", zhrf14)
    zhrf14 = re.sub("k", "ĸ", zhrf14)
    zhrf14 = re.sub("K", "ĸ", zhrf14)
    zhrf14 = re.sub("l", "ℓ", zhrf14)
    zhrf14 = re.sub("L", "ℓ", zhrf14)
    zhrf14 = re.sub("m", "м", zhrf14)
    zhrf14 = re.sub("M", "М", zhrf14)
    zhrf14 = re.sub("n", "и", zhrf14)
    zhrf14 = re.sub("N", "И", zhrf14)
    zhrf14 = re.sub("o", "σ", zhrf14)
    zhrf14 = re.sub("O", "Σ", zhrf14)
    zhrf14 = re.sub("p", "ρ", zhrf14)
    zhrf14 = re.sub("P", "Ρ", zhrf14)
    zhrf14 = re.sub("q", "q", zhrf14)
    zhrf14 = re.sub("Q", "Q", zhrf14)
    zhrf14 = re.sub("r", "я", zhrf14)
    zhrf14 = re.sub("R", "Я", zhrf14)
    zhrf14 = re.sub("s", "s", zhrf14)
    zhrf14 = re.sub("S", "S", zhrf14)
    zhrf14 = re.sub("t", "τ", zhrf14)
    zhrf14 = re.sub("T", "Τ", zhrf14)
    zhrf14 = re.sub("u", "υ", zhrf14)
    zhrf14 = re.sub("U", "Υ", zhrf14)
    zhrf14 = re.sub("v", "v", zhrf14)
    zhrf14 = re.sub("V", "V", zhrf14)
    zhrf14 = re.sub("w", "ω", zhrf14)
    zhrf14 = re.sub("W", "Ω", zhrf14)
    zhrf14 = re.sub("x", "x", zhrf14)
    zhrf14 = re.sub("X", "X", zhrf14)
    zhrf14 = re.sub("y", "y", zhrf14)
    zhrf14 = re.sub("Y", "Y", zhrf14)
    zhrf14 = re.sub("z", "z", zhrf14)
    zhrf14 = re.sub("Z", "Z", zhrf14)
    
    zhrf15 = re.sub('ض', 'ض', text)
    zhrf15 = re.sub('ص', 'صُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ث', 'ُثُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ق', 'قُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ف', 'فُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('غ', 'غُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ع', 'عُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ه', 'هـُ‘ـُ', zhrf15)
    zhrf15 = re.sub('خ', 'خُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ح', 'حُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ج', 'جُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('د', 'ډ', zhrf15)
    zhrf15 = re.sub('ذ', 'ڏ', zhrf15)
    zhrf15 = re.sub('ش', 'شُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('س', 'سُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ي', 'يُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ب', 'بُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ل', 'لُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ا', 'ٱ', zhrf15)
    zhrf15 = re.sub('ت', 'تُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ن', 'نُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('م', 'مُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ك', 'كُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ط', 'طُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('ئ', 'ئ', zhrf15)
    zhrf15 = re.sub('ء', 'ء', zhrf15)
    zhrf15 = re.sub('ؤ', 'ؤ', zhrf15)
    zhrf15 = re.sub('ر', 'ر', zhrf15)
    zhrf15 = re.sub('لا', 'لُـ‘ـُٱ', zhrf15)
    zhrf15 = re.sub('ى', 'ﮯ', zhrf15)
    zhrf15 = re.sub('ة', 'ةّ', zhrf15)
    zhrf15 = re.sub('و', 'وٌ', zhrf15)
    zhrf15 = re.sub('ز', 'زٍ', zhrf15)
    zhrf15 = re.sub('ظ', 'ظُـ‘ـُ', zhrf15)
    zhrf15 = re.sub('a', "ค", zhrf15)
    zhrf15 = re.sub('A', "ค", zhrf15)
    zhrf15 = re.sub("b", "๒", zhrf15)
    zhrf15 = re.sub("B", "๒", zhrf15)
    zhrf15 = re.sub("c", "ς", zhrf15)
    zhrf15 = re.sub("C", "Σ", zhrf15)
    zhrf15 = re.sub("d", "๔", zhrf15)
    zhrf15 = re.sub("D", "๔", zhrf15)
    zhrf15 = re.sub("e", "є", zhrf15)
    zhrf15 = re.sub("E", "Є", zhrf15)
    zhrf15 = re.sub("f", "Ŧ", zhrf15)
    zhrf15 = re.sub("F", "Ŧ", zhrf15)
    zhrf15 = re.sub("g", "ƃ", zhrf15)
    zhrf15 = re.sub("G", "Ƃ", zhrf15)
    zhrf15 = re.sub("h", "ђ", zhrf15)
    zhrf15 = re.sub("H", "Ђ", zhrf15)
    zhrf15 = re.sub("i", "เ", zhrf15)
    zhrf15 = re.sub("I", "เ", zhrf15)
    zhrf15 = re.sub("j", "ן", zhrf15)
    zhrf15 = re.sub("J", "ן", zhrf15)
    zhrf15 = re.sub("k", "к", zhrf15)
    zhrf15 = re.sub("K", "К", zhrf15)
    zhrf15 = re.sub("l", "l", zhrf15)
    zhrf15 = re.sub("L", "L", zhrf15)
    zhrf15 = re.sub("m", "๓", zhrf15)
    zhrf15 = re.sub("M", "๓", zhrf15)
    zhrf15 = re.sub("n", "ภ", zhrf15)
    zhrf15 = re.sub("N", "ภ", zhrf15)
    zhrf15 = re.sub("o", "๏", zhrf15)
    zhrf15 = re.sub("O", "๏", zhrf15)
    zhrf15 = re.sub("p", "ρ", zhrf15)
    zhrf15 = re.sub("P", "Ρ", zhrf15)
    zhrf15 = re.sub("q", "ც", zhrf15)
    zhrf15 = re.sub("Q", "Ც", zhrf15)
    zhrf15 = re.sub("r", "г", zhrf15)
    zhrf15 = re.sub("R", "Г", zhrf15)
    zhrf15 = re.sub("s", "ร", zhrf15)
    zhrf15 = re.sub("S", "ร", zhrf15)
    zhrf15 = re.sub("t", "t", zhrf15)
    zhrf15 = re.sub("T", "T", zhrf15)
    zhrf15 = re.sub("u", "ย", zhrf15)
    zhrf15 = re.sub("U", "ย", zhrf15)
    zhrf15 = re.sub("v", "ʌ", zhrf15)
    zhrf15 = re.sub("V", "Ʌ", zhrf15)
    zhrf15 = re.sub("w", "ฬ", zhrf15)
    zhrf15 = re.sub("W", "ฬ", zhrf15)
    zhrf15 = re.sub("x", "א", zhrf15)
    zhrf15 = re.sub("X", "א", zhrf15)
    zhrf15 = re.sub("y", "ץ", zhrf15)
    zhrf15 = re.sub("Y", "ץ", zhrf15)
    zhrf15 = re.sub("z", "z", zhrf15)
    zhrf15 = re.sub("Z", "Z", zhrf15)

    zhrf16 = re.sub('ض', 'ض', text)
    zhrf16 = re.sub('ص', 'صُـ,ـ', zhrf16)
    zhrf16 = re.sub('ث', 'ثُ', zhrf16)
    zhrf16 = re.sub('ق', 'قٌـ,ـ', zhrf16)
    zhrf16 = re.sub('ف', 'فُـ,ـ', zhrf16)
    zhrf16 = re.sub('غ', 'غٍـُـُُـُُُـُُُُـُُُـُُـُ', zhrf16)
    zhrf16 = re.sub('ع', 'عٌـِـِِـِـ', zhrf16)
    zhrf16 = re.sub('ه', 'ﮩ', zhrf16)
    zhrf16 = re.sub('خ', 'ځـٌٌـٌٌ', zhrf16)
    zhrf16 = re.sub('ح', 'حـًـًًـًًًـًًـًـ', zhrf16)
    zhrf16 = re.sub('ج', 'جـ,ـ', zhrf16)
    zhrf16 = re.sub('د', 'ڊ', zhrf16)
    zhrf16 = re.sub('ذ', 'ڏ', zhrf16)
    zhrf16 = re.sub('ش', 'شُـُـُُـُ', zhrf16)
    zhrf16 = re.sub('س', 'ڛـ,ـ', zhrf16)
    zhrf16 = re.sub('ي', 'ي', zhrf16)
    zhrf16 = re.sub('ب', 'بـٌـٌٌـٌٌٌـٌٌـٌ', zhrf16)
    zhrf16 = re.sub('ل', 'لُـِـِِـِِِـِِـِـ', zhrf16)
    zhrf16 = re.sub('ا', 'آ', zhrf16)
    zhrf16 = re.sub('ت', 'تـٌـٌٌـ', zhrf16)
    zhrf16 = re.sub('ن', 'نـِِـِـ', zhrf16)
    zhrf16 = re.sub('م', 'مـْـْْـْ', zhrf16)
    zhrf16 = re.sub('ك', 'كُـُ', zhrf16)
    zhrf16 = re.sub('ط', 'طُـٌـٌٌـٌ', zhrf16)
    zhrf16 = re.sub('ئ', 'ئ', zhrf16)
    zhrf16 = re.sub('ء', 'ء', zhrf16)
    zhrf16 = re.sub('ؤ', 'ؤ', zhrf16)
    zhrf16 = re.sub('ر', 'ر', zhrf16)
    zhrf16 = re.sub('لا', 'لُـِـِِـِِِـِِـِـآ', zhrf16)
    zhrf16 = re.sub('ى', 'ﮯ', zhrf16)
    zhrf16 = re.sub('ة', 'ة', zhrf16)
    zhrf16 = re.sub('و', 'وُ', zhrf16)
    zhrf16 = re.sub('ز', 'ڒٍ', zhrf16)
    zhrf16 = re.sub('ظ', 'ظً', zhrf16)
    zhrf16 = re.sub('a', "α", zhrf16)
    zhrf16 = re.sub('A', "Α", zhrf16)
    zhrf16 = re.sub("b", "Ⴆ", zhrf16)
    zhrf16 = re.sub("B", "Ⴆ", zhrf16)
    zhrf16 = re.sub("c", "ƈ", zhrf16)
    zhrf16 = re.sub("C", "Ƈ", zhrf16)
    zhrf16 = re.sub("d", "ԃ", zhrf16)
    zhrf16 = re.sub("D", "Ԃ", zhrf16)
    zhrf16 = re.sub("e", "ҽ", zhrf16)
    zhrf16 = re.sub("E", "Ҽ", zhrf16)
    zhrf16 = re.sub("f", "ϝ", zhrf16)
    zhrf16 = re.sub("F", "Ϝ", zhrf16)
    zhrf16 = re.sub("g", "ɠ", zhrf16)
    zhrf16 = re.sub("G", "Ɠ", zhrf16)
    zhrf16 = re.sub("h", "ԋ", zhrf16)
    zhrf16 = re.sub("H", "Ԋ", zhrf16)
    zhrf16 = re.sub("i", "ι", zhrf16)
    zhrf16 = re.sub("I", "Ι", zhrf16)
    zhrf16 = re.sub("j", "ʝ", zhrf16)
    zhrf16 = re.sub("J", "Ʝ", zhrf16)
    zhrf16 = re.sub("k", "ƙ", zhrf16)
    zhrf16 = re.sub("K", "Ƙ", zhrf16)
    zhrf16 = re.sub("l", "ʅ", zhrf16)
    zhrf16 = re.sub("L", "ʅ", zhrf16)
    zhrf16 = re.sub("m", "ɱ", zhrf16)
    zhrf16 = re.sub("M", "Ɱ", zhrf16)
    zhrf16 = re.sub("n", "ɳ", zhrf16)
    zhrf16 = re.sub("N", "ɳ", zhrf16)
    zhrf16 = re.sub("o", "σ", zhrf16)
    zhrf16 = re.sub("O", "Σ", zhrf16)
    zhrf16 = re.sub("p", "ρ", zhrf16)
    zhrf16 = re.sub("P", "Ρ", zhrf16)
    zhrf16 = re.sub("q", "ϙ", zhrf16)
    zhrf16 = re.sub("Q", "Ϙ", zhrf16)
    zhrf16 = re.sub("r", "ɾ", zhrf16)
    zhrf16 = re.sub("R", "ɾ", zhrf16)
    zhrf16 = re.sub("s", "ʂ", zhrf16)
    zhrf16 = re.sub("S", "ʂ", zhrf16)
    zhrf16 = re.sub("t", "ƚ", zhrf16)
    zhrf16 = re.sub("T", "Ƚ", zhrf16)
    zhrf16 = re.sub("u", "υ", zhrf16)
    zhrf16 = re.sub("U", "Υ", zhrf16)
    zhrf16 = re.sub("v", "ʋ", zhrf16)
    zhrf16 = re.sub("V", "Ʋ", zhrf16)
    zhrf16 = re.sub("w", "ɯ", zhrf16)
    zhrf16 = re.sub("W", "Ɯ", zhrf16)
    zhrf16 = re.sub("x", "x", zhrf16)
    zhrf16 = re.sub("X", "X", zhrf16)
    zhrf16 = re.sub("y", "ყ", zhrf16)
    zhrf16 = re.sub("Y", "Ყ", zhrf16)
    zhrf16 = re.sub("z", "ȥ", zhrf16)
    zhrf16 = re.sub("Z", "Ȥ", zhrf16)
    
    zhrf17 = re.sub('ض', 'ضےـ', text)
    zhrf17 = re.sub('ص', 'صےـ', zhrf17)
    zhrf17 = re.sub('ث', 'ثےـ', zhrf17)
    zhrf17 = re.sub('ق', 'قےـ', zhrf17)
    zhrf17 = re.sub('ف', 'فےـ', zhrf17)
    zhrf17 = re.sub('غ', 'غےـ', zhrf17)
    zhrf17 = re.sub('ع', 'عےـ', zhrf17)
    zhrf17 = re.sub('ه', 'هےـِ', zhrf17)
    zhrf17 = re.sub('خ', 'خےـ', zhrf17)
    zhrf17 = re.sub('ح', 'حےـ', zhrf17)
    zhrf17 = re.sub('ج', 'جےـ', zhrf17)
    zhrf17 = re.sub('د', 'د', zhrf17)
    zhrf17 = re.sub('ذ', 'ذ', zhrf17)
    zhrf17 = re.sub('ش', 'شےـ', zhrf17)
    zhrf17 = re.sub('س', 'سےـ', zhrf17)
    zhrf17 = re.sub('ي', 'يےـ', zhrf17)
    zhrf17 = re.sub('ب', 'بےـ', zhrf17)
    zhrf17 = re.sub('ل', 'ل', zhrf17)
    zhrf17 = re.sub('ا', 'آ', zhrf17)
    zhrf17 = re.sub('ت', 'تےـ', zhrf17)
    zhrf17 = re.sub('ن', 'نےـ', zhrf17)
    zhrf17 = re.sub('م', 'مےـ', zhrf17)
    zhrf17 = re.sub('ك', 'كےـ', zhrf17)
    zhrf17 = re.sub('ط', 'طےـ', zhrf17)
    zhrf17 = re.sub('ئ', 'ئ', zhrf17)
    zhrf17 = re.sub('ء', 'ء', zhrf17)
    zhrf17 = re.sub('ؤ', 'ؤ', zhrf17)
    zhrf17 = re.sub('ر', 'ر', zhrf17)
    zhrf17 = re.sub('لا', 'لآ', zhrf17)
    zhrf17 = re.sub('ى', 'ى', zhrf17)
    zhrf17 = re.sub('ة', 'ة', zhrf17)
    zhrf17 = re.sub('و', 'و', zhrf17)
    zhrf17 = re.sub('ز', 'ز', zhrf17)
    zhrf17 = re.sub('ظ', 'ظےـ', zhrf17)
    zhrf17 = re.sub('a', "🄰", zhrf17)
    zhrf17 = re.sub('A', "🄰", zhrf17)
    zhrf17 = re.sub("b", "🄱", zhrf17)
    zhrf17 = re.sub("B", "🄱", zhrf17)
    zhrf17 = re.sub("c", "🄲", zhrf17)
    zhrf17 = re.sub("C", "🄲", zhrf17)
    zhrf17 = re.sub("d", "🄳", zhrf17)
    zhrf17 = re.sub("D", "🄳", zhrf17)
    zhrf17 = re.sub("e", "🄴", zhrf17)
    zhrf17 = re.sub("E", "🄴", zhrf17)
    zhrf17 = re.sub("f", "🄵", zhrf17)
    zhrf17 = re.sub("F", "🄵", zhrf17)
    zhrf17 = re.sub("g", "🄶", zhrf17)
    zhrf17 = re.sub("G", "🄶", zhrf17)
    zhrf17 = re.sub("h", "🄷", zhrf17)
    zhrf17 = re.sub("H", "🄷", zhrf17)
    zhrf17 = re.sub("i", "🄸", zhrf17)
    zhrf17 = re.sub("I", "🄸", zhrf17)
    zhrf17 = re.sub("j", "🄹", zhrf17)
    zhrf17 = re.sub("J", "🄹", zhrf17)
    zhrf17 = re.sub("k", "🄺", zhrf17)
    zhrf17 = re.sub("K", "🄺", zhrf17)
    zhrf17 = re.sub("l", "🄻", zhrf17)
    zhrf17 = re.sub("L", "🄻", zhrf17)
    zhrf17 = re.sub("m", "🄼", zhrf17)
    zhrf17 = re.sub("M", "🄼", zhrf17)
    zhrf17 = re.sub("n", "🄽", zhrf17)
    zhrf17 = re.sub("N", "🄽", zhrf17)
    zhrf17 = re.sub("o", "🄾", zhrf17)
    zhrf17 = re.sub("O", "🄾", zhrf17)
    zhrf17 = re.sub("p", "🄿", zhrf17)
    zhrf17 = re.sub("P", "🄿", zhrf17)
    zhrf17 = re.sub("q", "🅀", zhrf17)
    zhrf17 = re.sub("Q", "??", zhrf17)
    zhrf17 = re.sub("r", "🅁", zhrf17)
    zhrf17 = re.sub("R", "🅁", zhrf17)
    zhrf17 = re.sub("s", "🅂", zhrf17)
    zhrf17 = re.sub("S", "🅂", zhrf17)
    zhrf17 = re.sub("t", "🅃", zhrf17)
    zhrf17 = re.sub("T", "🅃", zhrf17)
    zhrf17 = re.sub("u", "🅄", zhrf17)
    zhrf17 = re.sub("U", "🅄", zhrf17)
    zhrf17 = re.sub("v", "🅅", zhrf17)
    zhrf17 = re.sub("V", "🅅", zhrf17)
    zhrf17 = re.sub("w", "🅆", zhrf17)
    zhrf17 = re.sub("W", "🅆", zhrf17)
    zhrf17 = re.sub("x", "🅇", zhrf17)
    zhrf17 = re.sub("X", "🅇", zhrf17)
    zhrf17 = re.sub("y", "🅈", zhrf17)
    zhrf17 = re.sub("Y", "🅈", zhrf17)
    zhrf17 = re.sub("z", "🅉", zhrf17)
    zhrf17 = re.sub("Z", "🅉", zhrf17)
    
    zhrf18 = re.sub('ض', 'ضـ░ـ', text)
    zhrf18 = re.sub('ص', 'صـ░ـ', zhrf18)
    zhrf18 = re.sub('ث', 'ثـ░ـ', zhrf18)
    zhrf18 = re.sub('ق', 'قـ░ـ', zhrf18)
    zhrf18 = re.sub('ف', 'فـ░ـ', zhrf18)
    zhrf18 = re.sub('غ', 'غـ░ـ', zhrf18)
    zhrf18 = re.sub('ع', 'عـ░ـ', zhrf18)
    zhrf18 = re.sub('ه', 'هّ', zhrf18)
    zhrf18 = re.sub('خ', 'خـ░ـ', zhrf18)
    zhrf18 = re.sub('ح', 'حـ░ـ', zhrf18)
    zhrf18 = re.sub('ج', 'جـ░ـ', zhrf18)
    zhrf18 = re.sub('د', 'دٍ', zhrf18)
    zhrf18 = re.sub('ذ', 'ذِ', zhrf18)
    zhrf18 = re.sub('ش', 'شـ░ـ', zhrf18)
    zhrf18 = re.sub('س', 'سـ░ـ', zhrf18)
    zhrf18 = re.sub('ي', 'يـ░ـ', zhrf18)
    zhrf18 = re.sub('ب', 'بـ░ـ', zhrf18)
    zhrf18 = re.sub('ل', 'لَ', zhrf18)
    zhrf18 = re.sub('ا', 'آ', zhrf18)
    zhrf18 = re.sub('ت', 'تـ░ـ', zhrf18)
    zhrf18 = re.sub('ن', 'نـ░ـ', zhrf18)
    zhrf18 = re.sub('م', 'مـ░ـ', zhrf18)
    zhrf18 = re.sub('ك', 'كـ░ـ', zhrf18)
    zhrf18 = re.sub('ط', 'طـ░ـ', zhrf18)
    zhrf18 = re.sub('ئ', 'ﮯء', zhrf18)
    zhrf18 = re.sub('ء', 'ء', zhrf18)
    zhrf18 = re.sub('ؤ', 'ؤ', zhrf18)
    zhrf18 = re.sub('ر', 'رٍ', zhrf18)
    zhrf18 = re.sub('لا', 'لَآ', zhrf18)
    zhrf18 = re.sub('ى', 'ﮯ', zhrf18)
    zhrf18 = re.sub('ة', 'ةّ', zhrf18)
    zhrf18 = re.sub('و', 'وٌ', zhrf18)
    zhrf18 = re.sub('ز', 'زٍ', zhrf18)
    zhrf18 = re.sub('ظ', 'ظـ░ـ', zhrf18)
    zhrf18 = re.sub('a', "ḁ", zhrf18)
    zhrf18 = re.sub('A', "Ḁ", zhrf18)
    zhrf18 = re.sub("b", "ḅ", zhrf18)
    zhrf18 = re.sub("B", "Ḅ", zhrf18)
    zhrf18 = re.sub("c", "ḉ", zhrf18)
    zhrf18 = re.sub("C", "Ḉ", zhrf18)
    zhrf18 = re.sub("d", "ḍ", zhrf18)
    zhrf18 = re.sub("D", "Ḍ", zhrf18)
    zhrf18 = re.sub("e", "ḙ", zhrf18)
    zhrf18 = re.sub("E", "Ḙ", zhrf18)
    zhrf18 = re.sub("f", "ḟ", zhrf18)
    zhrf18 = re.sub("F", "Ḟ", zhrf18)
    zhrf18 = re.sub("g", "ḡ", zhrf18)
    zhrf18 = re.sub("G", "Ḡ", zhrf18)
    zhrf18 = re.sub("h", "ḣ", zhrf18)
    zhrf18 = re.sub("H", "Ḣ", zhrf18)
    zhrf18 = re.sub("i", "ḭ", zhrf18)
    zhrf18 = re.sub("I", "Ḭ", zhrf18)
    zhrf18 = re.sub("j", "ɉ", zhrf18)
    zhrf18 = re.sub("J", "Ɉ", zhrf18)
    zhrf18 = re.sub("k", "ḱ", zhrf18)
    zhrf18 = re.sub("K", "Ḱ", zhrf18)
    zhrf18 = re.sub("l", "ḷ", zhrf18)
    zhrf18 = re.sub("L", "Ḷ", zhrf18)
    zhrf18 = re.sub("m", "ḿ", zhrf18)
    zhrf18 = re.sub("M", "Ḿ", zhrf18)
    zhrf18 = re.sub("n", "ṅ", zhrf18)
    zhrf18 = re.sub("N", "Ṅ", zhrf18)
    zhrf18 = re.sub("o", "ṍ", zhrf18)
    zhrf18 = re.sub("O", "Ṍ", zhrf18)
    zhrf18 = re.sub("p", "ṕ", zhrf18)
    zhrf18 = re.sub("P", "Ṕ", zhrf18)
    zhrf18 = re.sub("q", "ҩ", zhrf18)
    zhrf18 = re.sub("Q", "Ҩ", zhrf18)
    zhrf18 = re.sub("r", "ṙ", zhrf18)
    zhrf18 = re.sub("R", "Ṙ", zhrf18)
    zhrf18 = re.sub("s", "ṡ", zhrf18)
    zhrf18 = re.sub("S", "Ṡ", zhrf18)
    zhrf18 = re.sub("t", "ṫ", zhrf18)
    zhrf18 = re.sub("T", "Ṫ", zhrf18)
    zhrf18 = re.sub("u", "ṳ", zhrf18)
    zhrf18 = re.sub("U", "Ṳ", zhrf18)
    zhrf18 = re.sub("v", "ṽ", zhrf18)
    zhrf18 = re.sub("V", "Ṽ", zhrf18)
    zhrf18 = re.sub("w", "ẁ", zhrf18)
    zhrf18 = re.sub("W", "Ẁ", zhrf18)
    zhrf18 = re.sub("x", "ẋ", zhrf18)
    zhrf18 = re.sub("X", "Ẋ", zhrf18)
    zhrf18 = re.sub("y", "ẏ", zhrf18)
    zhrf18 = re.sub("Y", "Ẏ", zhrf18)
    zhrf18 = re.sub("z", "ẑ", zhrf18)
    zhrf18 = re.sub("Z", "Ẑ", zhrf18)
    
    zhrf19 = re.sub('ض', 'ض', text)
    zhrf19 = re.sub('ص', 'ص̷', zhrf19)
    zhrf19 = re.sub('ث', 'ث̷', zhrf19)
    zhrf19 = re.sub('ق', 'ق̷', zhrf19)
    zhrf19 = re.sub('ف', 'ف̷َ', zhrf19)
    zhrf19 = re.sub('غ', 'غ̷', zhrf19)
    zhrf19 = re.sub('ع', 'ع̷ٍ', zhrf19)
    zhrf19 = re.sub('ه', 'ہ̷', zhrf19)
    zhrf19 = re.sub('خ', 'خ̷', zhrf19)
    zhrf19 = re.sub('ح', 'ح̷', zhrf19)
    zhrf19 = re.sub('ج', 'ج̷', zhrf19)
    zhrf19 = re.sub('د', 'د̷ِ', zhrf19)
    zhrf19 = re.sub('ذ', 'ذ̷', zhrf19)
    zhrf19 = re.sub('ش', 'ش̷ُ', zhrf19)
    zhrf19 = re.sub('س', 'س̷', zhrf19)
    zhrf19 = re.sub('ي', 'ي̷', zhrf19)
    zhrf19 = re.sub('ب', 'ب̷', zhrf19)
    zhrf19 = re.sub('ل', 'ل̷', zhrf19)
    zhrf19 = re.sub('ا', 'ٵ̷', zhrf19)
    zhrf19 = re.sub('ت', 'ت̷', zhrf19)
    zhrf19 = re.sub('ن', 'ن̷', zhrf19)
    zhrf19 = re.sub('م', 'م̷', zhrf19)
    zhrf19 = re.sub('ك', 'گ̷', zhrf19)
    zhrf19 = re.sub('ط', 'ط̷ُ', zhrf19)
    zhrf19 = re.sub('ئ', 'ﮯ̷ء', zhrf19)
    zhrf19 = re.sub('ء', 'ء', zhrf19)
    zhrf19 = re.sub('ؤ', 'ؤ', zhrf19)
    zhrf19 = re.sub('ر', 'ر̷', zhrf19)
    zhrf19 = re.sub('لا', 'ل̷ٵ̷ ', zhrf19)
    zhrf19 = re.sub('ى', 'ﮯ̷', zhrf19)
    zhrf19 = re.sub('ة', 'ة', zhrf19)
    zhrf19 = re.sub('و', 'ۆ̷', zhrf19)
    zhrf19 = re.sub('ز', 'ز̷', zhrf19)
    zhrf19 = re.sub('ظ', 'ظ̷ً', zhrf19)
    zhrf19 = re.sub('a', "ﾑ", zhrf19)
    zhrf19 = re.sub('A', "ﾑ", zhrf19)
    zhrf19 = re.sub("b", "乃", zhrf19)
    zhrf19 = re.sub("B", "乃", zhrf19)
    zhrf19 = re.sub("c", "c", zhrf19)
    zhrf19 = re.sub("C", "C", zhrf19)
    zhrf19 = re.sub("d", "d", zhrf19)
    zhrf19 = re.sub("D", "D", zhrf19)
    zhrf19 = re.sub("e", "乇", zhrf19)
    zhrf19 = re.sub("E", "乇", zhrf19)
    zhrf19 = re.sub("f", "ｷ", zhrf19)
    zhrf19 = re.sub("F", "ｷ", zhrf19)
    zhrf19 = re.sub("g", "g", zhrf19)
    zhrf19 = re.sub("G", "G", zhrf19)
    zhrf19 = re.sub("h", "ん", zhrf19)
    zhrf19 = re.sub("H", "ん", zhrf19)
    zhrf19 = re.sub("i", "ﾉ", zhrf19)
    zhrf19 = re.sub("I", "ﾉ", zhrf19)
    zhrf19 = re.sub("j", "ﾌ", zhrf19)
    zhrf19 = re.sub("J", "ﾌ", zhrf19)
    zhrf19 = re.sub("k", "ズ", zhrf19)
    zhrf19 = re.sub("K", "ズ", zhrf19)
    zhrf19 = re.sub("l", "ﾚ", zhrf19)
    zhrf19 = re.sub("L", "ﾚ", zhrf19)
    zhrf19 = re.sub("m", "ﾶ", zhrf19)
    zhrf19 = re.sub("M", "ﾶ", zhrf19)
    zhrf19 = re.sub("n", "刀", zhrf19)
    zhrf19 = re.sub("N", "刀", zhrf19)
    zhrf19 = re.sub("o", "o", zhrf19)
    zhrf19 = re.sub("O", "O", zhrf19)
    zhrf19 = re.sub("p", "ｱ", zhrf19)
    zhrf19 = re.sub("P", "ｱ", zhrf19)
    zhrf19 = re.sub("q", "q", zhrf19)
    zhrf19 = re.sub("Q", "Q", zhrf19)
    zhrf19 = re.sub("r", "尺", zhrf19)
    zhrf19 = re.sub("R", "尺", zhrf19)
    zhrf19 = re.sub("s", "丂", zhrf19)
    zhrf19 = re.sub("S", "丂", zhrf19)
    zhrf19 = re.sub("t", "ｲ", zhrf19)
    zhrf19 = re.sub("T", "ｲ", zhrf19)
    zhrf19 = re.sub("u", "u", zhrf19)
    zhrf19 = re.sub("U", "U", zhrf19)
    zhrf19 = re.sub("v", "√", zhrf19)
    zhrf19 = re.sub("V", "√", zhrf19)
    zhrf19 = re.sub("w", "w", zhrf19)
    zhrf19 = re.sub("W", "W", zhrf19)
    zhrf19 = re.sub("x", "ﾒ", zhrf19)
    zhrf19 = re.sub("X", "ﾒ", zhrf19)
    zhrf19 = re.sub("y", "ﾘ", zhrf19)
    zhrf19 = re.sub("Y", "ﾘ", zhrf19)
    zhrf19 = re.sub("z", "乙", zhrf19)
    zhrf19 = re.sub("Z", "乙", zhrf19)
    
    zhrf20 = re.sub('ض', 'ض', text)
    zhrf20 = re.sub('ص', 'ص̯͡', zhrf20)
    zhrf20 = re.sub('ث', 'ث̯͡', zhrf20)
    zhrf20 = re.sub('ق', 'ق̯͡', zhrf20)
    zhrf20 = re.sub('ف', 'ف̯͡', zhrf20)
    zhrf20 = re.sub('غ', 'غ̯͡', zhrf20)
    zhrf20 = re.sub('ع', 'ع̯͡', zhrf20)
    zhrf20 = re.sub('ه', 'ہ̯͡', zhrf20)
    zhrf20 = re.sub('خ', 'خ̯͡', zhrf20)
    zhrf20 = re.sub('ح', 'ح̯͡', zhrf20)
    zhrf20 = re.sub('ج', 'ج̯͡', zhrf20)
    zhrf20 = re.sub('د', 'د̯͡', zhrf20)
    zhrf20 = re.sub('ذ', 'ذ̯͡', zhrf20)
    zhrf20 = re.sub('ش', 'ش̯͡', zhrf20)
    zhrf20 = re.sub('س', 'س̯͡', zhrf20)
    zhrf20 = re.sub('ي', 'ي̯͡', zhrf20)
    zhrf20 = re.sub('ب', 'ب̯͡', zhrf20)
    zhrf20 = re.sub('ل', 'ل̯͡', zhrf20)
    zhrf20 = re.sub('ا', 'آ̯͡', zhrf20)
    zhrf20 = re.sub('ت', 'ت̯͡', zhrf20)
    zhrf20 = re.sub('ن', 'ن̯͡', zhrf20)
    zhrf20 = re.sub('م', 'م̯͡', zhrf20)
    zhrf20 = re.sub('ك', 'ك̯͡', zhrf20)
    zhrf20 = re.sub('ط', 'ط̯͡', zhrf20)
    zhrf20 = re.sub('ئ', 'ﮯ̯͡ء', zhrf20)
    zhrf20 = re.sub('ء', 'ء', zhrf20)
    zhrf20 = re.sub('ؤ', 'ؤ', zhrf20)
    zhrf20 = re.sub('ر', 'ر̯͡', zhrf20)
    zhrf20 = re.sub('لا', 'ل̯͡آ̯͡', zhrf20)
    zhrf20 = re.sub('ى', 'ﮯ̯͡', zhrf20)
    zhrf20 = re.sub('ة', 'ة', zhrf20)
    zhrf20 = re.sub('و', 'ۆ̯͡', zhrf20)
    zhrf20 = re.sub('ز', 'ز̯͡', zhrf20)
    zhrf20 = re.sub('ظ', 'ظ̯͡', zhrf20)
    zhrf20 = re.sub('a', "【a】", zhrf20)
    zhrf20 = re.sub('A', "【A】", zhrf20)
    zhrf20 = re.sub("b", "【b】", zhrf20)
    zhrf20 = re.sub("B", "【B】", zhrf20)
    zhrf20 = re.sub("c", "【c】", zhrf20)
    zhrf20 = re.sub("C", "【C】", zhrf20)
    zhrf20 = re.sub("d", "【d】", zhrf20)
    zhrf20 = re.sub("D", "【D】", zhrf20)
    zhrf20 = re.sub("e", "【e】", zhrf20)
    zhrf20 = re.sub("E", "【E】", zhrf20)
    zhrf20 = re.sub("f", "【f】", zhrf20)
    zhrf20 = re.sub("F", "【F】", zhrf20)
    zhrf20 = re.sub("g", "【g】", zhrf20)
    zhrf20 = re.sub("G", "【G】", zhrf20)
    zhrf20 = re.sub("h", "【h】", zhrf20)
    zhrf20 = re.sub("H", "【H】", zhrf20)
    zhrf20 = re.sub("i", "【i】", zhrf20)
    zhrf20 = re.sub("I", "【I】", zhrf20)
    zhrf20 = re.sub("j", "【j】", zhrf20)
    zhrf20 = re.sub("J", "【J】", zhrf20)
    zhrf20 = re.sub("k", "【k】", zhrf20)
    zhrf20 = re.sub("K", "【K】", zhrf20)
    zhrf20 = re.sub("l", "【l】", zhrf20)
    zhrf20 = re.sub("L", "【L】", zhrf20)
    zhrf20 = re.sub("m", "【m】", zhrf20)
    zhrf20 = re.sub("M", "【M】", zhrf20)
    zhrf20 = re.sub("n", "【n】", zhrf20)
    zhrf20 = re.sub("N", "【N】", zhrf20)
    zhrf20 = re.sub("o", "【o】", zhrf20)
    zhrf20 = re.sub("O", "【O】", zhrf20)
    zhrf20 = re.sub("p", "【p】", zhrf20)
    zhrf20 = re.sub("P", "【P】", zhrf20)
    zhrf20 = re.sub("q", "【q】", zhrf20)
    zhrf20 = re.sub("Q", "【Q】", zhrf20)
    zhrf20 = re.sub("r", "【r】", zhrf20)
    zhrf20 = re.sub("R", "【R】", zhrf20)
    zhrf20 = re.sub("s", "【s】", zhrf20)
    zhrf20 = re.sub("S", "【S】", zhrf20)
    zhrf20 = re.sub("t", "【t】", zhrf20)
    zhrf20 = re.sub("T", "【T】", zhrf20)
    zhrf20 = re.sub("u", "【u】", zhrf20)
    zhrf20 = re.sub("U", "【U】", zhrf20)
    zhrf20 = re.sub("v", "【v】", zhrf20)
    zhrf20 = re.sub("V", "【V】", zhrf20)
    zhrf20 = re.sub("w", "【w】", zhrf20)
    zhrf20 = re.sub("W", "【W】", zhrf20)
    zhrf20 = re.sub("x", "【x】", zhrf20)
    zhrf20 = re.sub("X", "【X】", zhrf20)
    zhrf20 = re.sub("y", "【y】", zhrf20)
    zhrf20 = re.sub("Y", "【Y】", zhrf20)
    zhrf20 = re.sub("z", "【z】", zhrf20)
    zhrf20 = re.sub("Z", "【Z】", zhrf20)
    
    zhrf21 = re.sub('ض', 'ضـ⫍⫎ـ', text)
    zhrf21 = re.sub('ص', 'صـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ث', 'ثـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ق', 'قـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ف', 'فـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('غ', 'غـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ع', 'عـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ه', 'هّ', zhrf21)
    zhrf21 = re.sub('خ', 'خـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ح', 'حـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ج', 'جـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('د', 'دٍ', zhrf21)
    zhrf21 = re.sub('ذ', 'ذِ', zhrf21)
    zhrf21 = re.sub('ش', 'شـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('س', 'سـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ي', 'يـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ب', 'بـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ل', 'لَ', zhrf21)
    zhrf21 = re.sub('ا', 'آ', zhrf21)
    zhrf21 = re.sub('ت', 'تـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ن', 'نـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('م', 'مـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ك', 'كـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ط', 'طـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('ئ', 'ﮯء', zhrf21)
    zhrf21 = re.sub('ء', 'ء', zhrf21)
    zhrf21 = re.sub('ؤ', 'ؤ', zhrf21)
    zhrf21 = re.sub('ر', 'رٍ', zhrf21)
    zhrf21 = re.sub('لا', 'لَآ', zhrf21)
    zhrf21 = re.sub('ى', 'ﮯ', zhrf21)
    zhrf21 = re.sub('ة', 'ةّ', zhrf21)
    zhrf21 = re.sub('و', 'وٌ', zhrf21)
    zhrf21 = re.sub('ز', 'زٍ', zhrf21)
    zhrf21 = re.sub('ظ', 'ظـ⫍⫎ـ', zhrf21)
    zhrf21 = re.sub('a', "a̺͆", zhrf21)
    zhrf21 = re.sub('A', "A̺͆", zhrf21)
    zhrf21 = re.sub("b", "b̺͆", zhrf21)
    zhrf21 = re.sub("B", "B̺͆", zhrf21)
    zhrf21 = re.sub("c", "c̺͆", zhrf21)
    zhrf21 = re.sub("C", "C̺͆", zhrf21)
    zhrf21 = re.sub("d", "d̺͆", zhrf21)
    zhrf21 = re.sub("D", "D̺͆", zhrf21)
    zhrf21 = re.sub("e", "e̺͆", zhrf21)
    zhrf21 = re.sub("E", "E̺͆", zhrf21)
    zhrf21 = re.sub("f", "f̺͆", zhrf21)
    zhrf21 = re.sub("F", "F̺͆", zhrf21)
    zhrf21 = re.sub("g", "g̺͆", zhrf21)
    zhrf21 = re.sub("G", "G̺͆", zhrf21)
    zhrf21 = re.sub("h", "h̺͆", zhrf21)
    zhrf21 = re.sub("H", "H̺͆", zhrf21)
    zhrf21 = re.sub("i", "i̺͆", zhrf21)
    zhrf21 = re.sub("I", "I̺͆", zhrf21)
    zhrf21 = re.sub("j", "j̺͆", zhrf21)
    zhrf21 = re.sub("J", "J̺͆", zhrf21)
    zhrf21 = re.sub("k", "k̺͆", zhrf21)
    zhrf21 = re.sub("K", "K̺͆", zhrf21)
    zhrf21 = re.sub("l", "l̺͆", zhrf21)
    zhrf21 = re.sub("L", "L̺͆", zhrf21)
    zhrf21 = re.sub("m", "m̺͆", zhrf21)
    zhrf21 = re.sub("M", "M̺͆", zhrf21)
    zhrf21 = re.sub("n", "n̺͆", zhrf21)
    zhrf21 = re.sub("N", "N̺͆", zhrf21)
    zhrf21 = re.sub("o", "o̺͆", zhrf21)
    zhrf21 = re.sub("O", "O̺͆", zhrf21)
    zhrf21 = re.sub("p", "p̺͆", zhrf21)
    zhrf21 = re.sub("P", "P̺͆", zhrf21)
    zhrf21 = re.sub("q", "q̺͆", zhrf21)
    zhrf21 = re.sub("Q", "Q̺͆", zhrf21)
    zhrf21 = re.sub("r", "r̺͆", zhrf21)
    zhrf21 = re.sub("R", "R̺͆", zhrf21)
    zhrf21 = re.sub("s", "s̺͆", zhrf21)
    zhrf21 = re.sub("S", "S̺͆", zhrf21)
    zhrf21 = re.sub("t", "t̺͆", zhrf21)
    zhrf21 = re.sub("T", "T̺͆", zhrf21)
    zhrf21 = re.sub("u", "u̺͆", zhrf21)
    zhrf21 = re.sub("U", "U̺͆", zhrf21)
    zhrf21 = re.sub("v", "v̺͆", zhrf21)
    zhrf21 = re.sub("V", "V̺͆", zhrf21)
    zhrf21 = re.sub("w", "w̺͆", zhrf21)
    zhrf21 = re.sub("W", "W̺͆", zhrf21)
    zhrf21 = re.sub("x", "x̺͆", zhrf21)
    zhrf21 = re.sub("X", "X̺͆", zhrf21)
    zhrf21 = re.sub("y", "Y̺͆", zhrf21)
    zhrf21 = re.sub("Y", "Y̺͆", zhrf21)
    zhrf21 = re.sub("z", "z̺͆", zhrf21)
    zhrf21 = re.sub("Z", "Z̺͆", zhrf21)
    
    
    Text_Zhrfa = "1- `" + zhrf + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf2 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf3 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf4 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf5 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf6 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf7 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf8 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf9 + random.choice(EmojeS) \
                 + "`\n\n` " + zhrf10 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf11 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf12 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf13 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf14 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf15 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf16 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf17 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf18 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf19 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf20 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf21 + random.choice(Emoje) \
                 + "`\n\n` " + zhrf5 + random.choice(EmojeS) 
    Text_Zhrfa = Text_Zhrfa + "`\n\n اضغط علـي الاسـم ليـتم النـسخ \n│ \n🐉"
    await m.reply_text(Text_Zhrfa)     
  